[
    {
        "post_title": "Does apple send out a notification if family sharing is turned off?",
        "post_score": 0,
        "post_id": "1dcgf7m",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dcgf7m/does_apple_send_out_a_notification_if_family/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-10 10:12:46",
        "post_text": "Hi, so i might kinda have a weird situation. \n\nAnyway I live in the Philippines and my parents are like super strict and track everything I do. Unfortunately a few years ago I found out I was queer and have to hide it from them. I managed to hide it from them so far and am now in college. \n\nThe thing is I need to buy procreate for my class. I have a payment method that works after asking my friend to try it out for me. I just don’t have a way to purchase it at the moment because I’m on family sharing and need permission to purchase. \n\nLuckily I have access to my dad’s phone and he is the organizer. I was just wondering if a notification would be sent if I turned off family sharing. I just don’t want my parents to find out I bought procreate cause that means they’ll regularly ask to see the contents of the app and I don’t want to delete any of my art just because I fear they might see it. ",
        "post_comments": [
            {
                "comment_id": "l7xrfcm",
                "comment_body": "You are no longer under 13, so as long as you have enough balance in your Apple account, your purchases should not be sent to your parents for payment. To add balances, just purchase Apple Gift cards in your country.\n\nhttps://www.apple.com/ph/shop/gift-cards\n\nBtw, if you are doing purchase sharing to your parents, then they can see your purchased software, so you may want to stop it.",
                "comment_author": "ussv0y4g3r",
                "comment_dateTime": "2024-06-10 11:04:54",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l7xqv8p",
                "comment_body": "just take a deep breath what is the worst that can happen.",
                "comment_author": "Outrageous-Carob-236",
                "comment_dateTime": "2024-06-10 10:57:53",
                "comment_score": -6,
                "replies": [
                    {
                        "comment_id": "l7xt0rz",
                        "comment_body": "Is this meant to be reassuring? Because the answer to that question is not gonna reassure OP.",
                        "comment_author": "strawbrmoon",
                        "comment_dateTime": "2024-06-10 11:24:50",
                        "comment_score": 5,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Give old phone to kid - worried about deleting photos",
        "post_score": 1,
        "post_id": "1dcepgh",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dcepgh/give_old_phone_to_kid_worried_about_deleting/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-10 08:11:18",
        "post_text": "I want to give my old iPhone to my kid. I’ve removed almost all the alls from it. I mainly want him to use it for music and photos. \n\nWhat’s the best way for him to use it without affecting my iCloud account but still being able to use apps registered in my name?",
        "post_comments": [
            {
                "comment_id": "l7xdf0v",
                "comment_body": "Set up Apple family and share apps/purchases. Set him up as a child account and you can micromanage what he does. Create an iCloud account and if he’s under 13 it will be simple",
                "comment_author": "Theblobsnark",
                "comment_dateTime": "2024-06-10 08:17:48",
                "comment_score": 5,
                "replies": []
            },
            {
                "comment_id": "l7xl1iq",
                "comment_body": "Wipe the phone (restore to factory settings) and set it up from scratch using his Apple ID. Then use family sharing to share apps",
                "comment_author": "LTS81",
                "comment_dateTime": "2024-06-10 09:45:28",
                "comment_score": 4,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Help Backing up iPhone photos",
        "post_score": 1,
        "post_id": "1dceblb",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dceblb/help_backing_up_iphone_photos/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-10 07:45:32",
        "post_text": "So I recently bought an iPhone 15. Transferred all my data, photos and all media from my previous iPhone 8S and had been using it without any problems. I also pay for iCloud+, so all my photos are synced to the cloud as well.\n\nLast week I found out that all my 2023 photos were missing, both on my iCloud and locally. This was really strange since I made no changes, nor deleted any photos recently and photos sync shows up to date.  I really panicked,because last year we made a very memorable trip to Washington and took many photos. I Checked on iCloud from my PC and they were also gone. I thought the photos were gone for good until today I found, miraculously, a really old iPhone 6s I had previously which was last synced on March. It still has all the missing 2023 photos, so my first thought was to immediately turn off iCloud sync so they wouldn’t auto delete. Now I need some advice on how can I proceed to save the missing photos.\n\nI tried connecting the iPhone via USB and using iTunes but when syncing finishes it is still missing all the 2023 photos and just downloads the most up to date photos stored in iCloud.\n\npd. Sorry for my bad English. This is not my first language. I really appreciate if you guys could shed some light on this matter.",
        "post_comments": [
            {
                "comment_id": "l7xekga",
                "comment_body": "Transfer them to Dropbox or email them to yourself maybe?",
                "comment_author": "Pigeonofthesea8",
                "comment_dateTime": "2024-06-10 08:30:25",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8j39v5",
                "comment_body": "I understand your situation where you recently discovered all your photos from 2023 are missing both from iCloud and your local device, which is understandably distressing. You've taken a wise step by disabling iCloud sync to prevent further data loss.\n\nTo help you retrieve the lost photos, I suggest using **MobiKin Doctor for iOS**. This tool can scan and recover all photos from your iCloud, even if they are no longer visible on your device.\n\nYou can download and install MobiKin Doctor for iOS, then follow the steps to scan your iCloud account. This tool is specifically designed to recover lost data from iOS devices, including photos, contacts, messages, and more.",
                "comment_author": "AllenyGavin",
                "comment_dateTime": "2024-06-14 05:37:18",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Background apps are restarting too often",
        "post_score": 1,
        "post_id": "1dcculw",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dcculw/background_apps_are_restarting_too_often/",
        "post_numComments": 0,
        "post_dateTime": "2024-06-10 06:14:03",
        "post_text": "Background Apps Refreshing Way too Often\n\nPrior to the iPhone 15 Pro, I had an iPhone 11 Pro Max and an issue that cropped up recently was that any time I sent an app to the background and went to another app, if I were to go back to the original app, it would refresh, which is a pain if I'm trying to copy over text or using a bank app, etc. It's happening almost every time I switch apps, even with only 2 apps being active.\n\nI backed up my device and bought a new iPhone 15 Pro in hopes that by upgrading my phone with a better chip and more RAM, it'd get rid of this problem but it still exists. Anyone else experience this? I backed up my iPhone 11 Pro Max and loaded onto the new phone, so maybe it's something related to that?",
        "post_comments": []
    }
]