[
    {
        "post_title": "Vpn",
        "post_score": 1,
        "post_id": "1dembgi",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dembgi/vpn/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-13 02:43:27",
        "post_text": "Whats the difference between device vpn and personal vpn in settings?",
        "post_comments": [
            {
                "comment_id": "l8jyll3",
                "comment_body": "I wouldn't use a VPN at all unless u need to change ur region.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:00:16",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8mwsiu",
                        "comment_body": "Why",
                        "comment_author": "ItsRobinn_",
                        "comment_dateTime": "2024-06-14 22:45:12",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8myi93",
                                "comment_body": "It doesn't add any real security value and it creates more connections in between u and ur service.\n\nAnd if anything should happen(ie internet hiccup, updating sometimes, or anything else regarding the connection) it messes up internet connectivity with devices.\n\nVpns are just another security issue wrapped up in silver and gold. The companies advertise them as additional security but it really doesn't do that. They are allowed to get away with it as it does change your ip address to a different location.",
                                "comment_author": "tlasan1",
                                "comment_dateTime": "2024-06-14 22:54:58",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Is there a setting that controls the options when you swipe down a temporary notification?",
        "post_score": 1,
        "post_id": "1dem3fd",
        "post_url": "https://i.redd.it/qhg5d1kuh86d1.jpeg",
        "post_numComments": 0,
        "post_dateTime": "2024-06-13 02:31:47",
        "post_text": "I’m not sure how many people are aware but if you’re on your iPhone and you get a push notification at the top of your screen that lasts for around three seconds and disappears. If you swipe down on it during the three seconds, you often get a few options (that I think are dictated by the app).\n\nI have a 2FA app that used to display something like, “Is this you” and then present “Yes” and “No” as the options when I swiped down. This was great because I could tap “Yes” without actually going into the app. Now, when I swipe down on the temporary push notification, it shows the “Yes” and “No” options for literally half a second, then they quickly change to one option that is “Review”. When I tap that one option, it takes me into the app (as if I clicked on the notification itself). I’m so confused because I do see the Yes and No briefly but for some reason it switches quickly to that useless one option. Is this a setting somewhere?\n\nThanks in advance!",
        "post_comments": []
    },
    {
        "post_title": "can someone just explain why this happens?",
        "post_score": 5,
        "post_id": "1deluvz",
        "post_url": "https://i.redd.it/xleqdxpnf86d1.jpeg",
        "post_numComments": 5,
        "post_dateTime": "2024-06-13 02:19:31",
        "post_text": "Mind you this is not a cropped photo the voice to speech icon and the keyboard switch are off the screen , like i cant touch them and i dont know how to fix this i restarted my phone prolly a 100 times and still wont get fixed ",
        "post_comments": [
            {
                "comment_id": "l8cscbl",
                "comment_body": "You need to do a hard restart. Press the volume buttons on the left side of the phone up and then down and then hold in the right hand power button down until. The phone goes off and then restarts with the Apple logo. That should fix your problem.",
                "comment_author": "lovingtate",
                "comment_dateTime": "2024-06-13 02:35:29",
                "comment_score": 5,
                "replies": []
            },
            {
                "comment_id": "l8cs4r4",
                "comment_body": "I guess before restarting time number 99, you tried to wipe/recovery the iPhone, didn’t you?",
                "comment_author": "Fedelopezf",
                "comment_dateTime": "2024-06-13 02:34:04",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8cuvct",
                        "comment_body": "i  actually meant the 100 times metaphorically i did multime times still but to no good result",
                        "comment_author": "yaksha_ftw",
                        "comment_dateTime": "2024-06-13 02:52:20",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8ctfoj",
                "comment_body": "I did that and still the smas issue",
                "comment_author": "yaksha_ftw",
                "comment_dateTime": "2024-06-13 02:42:43",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8ek65k",
                        "comment_body": "If you still haven't fixed it, just stop by an Apple store and show them. Hope you get it resolved, pretty strange issue.",
                        "comment_author": "CandiceSwaninthepool",
                        "comment_dateTime": "2024-06-13 12:09:42",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Is usb-c to usb-c superior to usb-c to usb-a?",
        "post_score": 11,
        "post_id": "1deln4j",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deln4j/is_usbc_to_usbc_superior_to_usbc_to_usba/",
        "post_numComments": 17,
        "post_dateTime": "2024-06-13 02:08:38",
        "post_text": "Hi all. I just got the iPhone 15 pro which came with the USB-C to USB-C charging cord. I had the iPhone 12 previously so I have a lot of charging ports for the USB-A. I’m ordering more wires for the 15 and was curious if it made a difference if I got USB-A to USB-C over USB-C to USB-C? Thanks in advance. ",
        "post_comments": [
            {
                "comment_id": "l8cry4w",
                "comment_body": "The whole draw of USB-C for me would be that I can connect my laptop to my wall charger, my phone to my wall charger, my powerbank to my wall charger, my powerbank to my phone, and my phone to my laptop all with the same cable.  \n   \nC to A is basically pointless for me since I can’t even connect my devices to each other with it",
                "comment_author": "pizza_toast102",
                "comment_dateTime": "2024-06-13 02:32:52",
                "comment_score": 18,
                "replies": []
            },
            {
                "comment_id": "l8cwck9",
                "comment_body": "typical USB-A is limited to 2.5-12 watts, specific cables with a specific port might be up to 18 watts.\n\nthe typical iPhone USB-C bricks (the ones that came with past phones and ipads) are 20 watts, unless specified otherwise.\n\nApple never officially reveals its charging speed, but I believe tests show the max to be be between 20-29 watts (even if you use a 45w or 60w charger with the right cable, the phone will only charge at 20-29w)\n\nits a difference of 0 to 50% in 30 minutes, vs 0 to 50% in 2 hours\n\nhighly recommended to start using C to C. but if you're ok with slower speeds, and if there is no heat problems with the older cables or bricks (heat can degreate the battery and/or be a fire hazard for those old bricks) then that's fine too, stick with the old A to C.",
                "comment_author": "dayankuo234",
                "comment_dateTime": "2024-06-13 03:02:10",
                "comment_score": 9,
                "replies": []
            },
            {
                "comment_id": "l8ecmbf",
                "comment_body": "Also note you want name brand cables (and chargers) - Apple, Samsung, Anker.com (Costco CANADA Carrie’s Anker), Monoprice, …. and not something from the dollar store. Even cables from Amazon can be counterfeit",
                "comment_author": "Patrol-007",
                "comment_dateTime": "2024-06-13 10:44:46",
                "comment_score": 3,
                "replies": [
                    {
                        "comment_id": "l8fmj18",
                        "comment_body": "I planned on ordering from Amazon. Can certain cables damage the phone battery?",
                        "comment_author": "Laps8240",
                        "comment_dateTime": "2024-06-13 16:54:54",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8gcgin",
                                "comment_body": "Fires via melting or shorting out.",
                                "comment_author": "Patrol-007",
                                "comment_dateTime": "2024-06-13 19:18:52",
                                "comment_score": 1,
                                "replies": [
                                    {
                                        "comment_id": "l8hmol9",
                                        "comment_body": "Aren’t brands like Anker ok to use?",
                                        "comment_author": "Laps8240",
                                        "comment_dateTime": "2024-06-13 23:36:36",
                                        "comment_score": 1,
                                        "replies": [
                                            {
                                                "comment_id": "l8hpog7",
                                                "comment_body": "Yes. Anker.com, Costco carries them, I use them. But Amazon is having problems with counterfeit items, so I’d get the cable from Anker website or from Costco store. \n\nOne of mine is damaged and I tossed it. Looking at your post about intermittent usage of fwd/reverse is puzzling. Hence trying different cable, vehicle and phone, and cleaning the physical port (vehicle, phone, cable ends)",
                                                "comment_author": "Patrol-007",
                                                "comment_dateTime": "2024-06-13 23:54:20",
                                                "comment_score": 1,
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8ddebb",
                "comment_body": "USB C typically supports faster charging speeds. the only USB A fast chargers i have seen are those from chinese brands like Xiaomi and Huawei, but i believe they are proprietary and not an open standard. \n\nfor the fastest possible charging you’ll need a 30w charger that supports 9V 3A for 27w. \n\nif you’re okay with the charging speeds on your current adapters then just get A to C cables.",
                "comment_author": "kwanye_west",
                "comment_dateTime": "2024-06-13 04:57:22",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8e97uw",
                "comment_body": "USB-C to C is much better than USB-C to A. USB-A ports only charge to a max of 12 watts, while USB-C charging ports START at 20 watts and can support over 100 watts. Your phone can support up to right around 28 watt charging speeds so you’ll need a USB-C to USB-C to get the fastest charging possible. \n\nUSB-C transfer speeds are also significantly faster than USB-A so if you are using your phone for it’s camera, having a USB-C cord will make it much easier to transfer those photos and videos over.\n\nTo a lesser extent it’s now possible to charge your phone with another phones battery because of the reversible cord so it’s just overall a better evolution of USB technology. It will soon be the new standard so might as well start now",
                "comment_author": "Fenderman420",
                "comment_dateTime": "2024-06-13 10:03:12",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8myw0h",
                        "comment_body": "> USB-C transfer speeds are also significantly faster than USB-A so if you are using your phone for it’s camera, having a USB-C cord will make it much easier to transfer those photos and videos over.\n\nUSB C/A is primarily just the physical shape of the connector and not indicative of transfer speed. There are devices with 10Gbps USB-A ports, though I don't believe Apple sells any (I think their USB-A ports only go up to 5Gbps), there are also USB-C cables that only support USB 2.0 speeds (usually sold as \"charging cables\", like the cable that comes with iPads).\n\nContrary to popular belief, buying USB hardware isn't *that* hard, just make sure to look for cables that indicate their rated speed.\n\n480Mbps is USB 2.0, 5Gbps is basic USB 3 (most widely supported). I usually buy 10Gbps cables, there is also a somewhat rare 20Gbps connection in the USB 3 family, but at that point I'd just go for Thunderbolt 4/USB4 rated cables.\n\nPro Tip: As long as the host, client, and hub devices support it, 5Gbps -> 10Gbps isn't restricted by the physical wiring like 480Mbps -> 5Gbps is, but mostly imposed by cable quality. I have some cables and adapters that are rated for 5Gbps, but run fine at 10Gbps, but the connection may be downgraded by the USB controllers.",
                        "comment_author": "MartinsRedditAccount",
                        "comment_dateTime": "2024-06-14 22:57:09",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8eajbx",
                "comment_body": "It seems Apple has nerfed USB-A connection to an iPhone 15 Pro for some reason, at least according to my observations.\n\nThe iPhone 15 Pro I have always maxes out at 7.5W charging speed with USB-A ports even if the said port charges an iPhone 14 Pro at 10W or more power. I have several chargers and cables to test this out and they all had the same results. If I want it to charge faster, it has to be USB-C, and it goes up to about 21W so long as the charger supports it.",
                "comment_author": "Namuori",
                "comment_dateTime": "2024-06-13 10:19:09",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8exem5",
                "comment_body": "A-C is not my preferred option at all. But, I’m traveling in Spain and it’s compatible with the bus I’m on right now. I always keep a spare.\n\nhttps://preview.redd.it/qghzoukiyb6d1.png?width=3024&format=png&auto=webp&s=1a118b16c756377bfd8b5a20cb44b0a65ddbec54",
                "comment_author": "heeph0p",
                "comment_dateTime": "2024-06-13 14:10:59",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8g4u98",
                "comment_body": "I go with as many Type C connectors as I can and as little Type A as I can. We’re slowly phasing out Type A completely.",
                "comment_author": "Cool-Newspaper-1",
                "comment_dateTime": "2024-06-13 18:36:54",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ct805",
                "comment_body": "It's not really a matter of which is superior? It's a matter of which do you need. \n\nIf you don't want to replace your existing power bricks, then you'll want USB-A to USB-C. \n\nIf you're replacing the power bricks, then go with USB-C.",
                "comment_author": "James_Atlanta",
                "comment_dateTime": "2024-06-13 02:41:19",
                "comment_score": 4,
                "replies": [
                    {
                        "comment_id": "l8cthd5",
                        "comment_body": "Ok this is all I really needed to know. I know they say usb c charges faster, I just didn’t know if specifically usb c to usb c made a difference in charging speed. I’d like to keep all my power bricks so I’ll go with usb c to usb a. Thank you!",
                        "comment_author": "Laps8240",
                        "comment_dateTime": "2024-06-13 02:43:02",
                        "comment_score": 2,
                        "replies": [
                            {
                                "comment_id": "l8cv4ux",
                                "comment_body": "C to c is way faster than a to c for charging and data",
                                "comment_author": "atan420",
                                "comment_dateTime": "2024-06-13 02:54:04",
                                "comment_score": 5,
                                "replies": [
                                    {
                                        "comment_id": "l8dhkd2",
                                        "comment_body": "Not necessarily. Even the USB-C cable that comes with the 15s only supports USB2 transfer rates. \n\nPoint is, being Type C doesn’t guarantee faster speed. Check the cable details.",
                                        "comment_author": "Furrealyo",
                                        "comment_dateTime": "2024-06-13 05:27:32",
                                        "comment_score": 3,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Is my phone hacked??",
        "post_score": 0,
        "post_id": "1dek2pn",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dek2pn/is_my_phone_hacked/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-13 00:55:52",
        "post_text": "So I just received an unexpected call from somebody I know and I answer the phone and they SWEAR that I called them. \n\nThey swear that their iPhone was ringing and picked up the phone, when on my end MY iPhone was ringing and I picked up the phone.\n\nWhile I was on the phone with this person, I get ANOTHER unexpected call from a DIFFERENT PERSON and the same thing occurs, where they say I called them when I most certainly did not. They called me.\n\nI am very confused. These are two people that do not know each other so I don’t believe this to be any sort of prank and I am concerned that my phone is hacked. \n\nAny help would be greatly appreciated. Thanks.\n ",
        "post_comments": [
            {
                "comment_id": "l8e2bkt",
                "comment_body": "Your phone is not hacked. End of story.",
                "comment_author": "happycanliao",
                "comment_dateTime": "2024-06-13 08:42:33",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8jyxas",
                "comment_body": "Its not hacked. Some people spoof phone numbers they find int he phone book to robo call. Nothing u can do.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:04:14",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Keep seeing grey bar in safari?",
        "post_score": 7,
        "post_id": "1dejb6u",
        "post_url": "https://www.reddit.com/gallery/1dejb6u",
        "post_numComments": 2,
        "post_dateTime": "2024-06-13 00:21:41",
        "post_text": "This is a new thing that has popped up from nowhere. Everytime I search something in safari a grey bar gets in the way. Any clues as to what this is?\n\nIt is getting in the way of links now also. ",
        "post_comments": [
            {
                "comment_id": "l8c9fag",
                "comment_body": "It’s the top of the keyboard I’m pretty sure. Here’s a screenshot of mine, it might look different cuz I’m on the iOS 18 beta\n\nhttps://preview.redd.it/jzzx5recw76d1.jpeg?width=1284&format=pjpg&auto=webp&s=18cf9e2b21fac8204e0e1f5f77656f0bc3324147",
                "comment_author": "jader242",
                "comment_dateTime": "2024-06-13 00:31:19",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8cnxze",
                "comment_body": "It’s the keyboard toolbar. The arrows can be use to tab between text fields. It’s just bugged so it appears detached.",
                "comment_author": "DimitriTooProBro",
                "comment_dateTime": "2024-06-13 02:05:52",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Message to GC with androids says not delivered but it actually is delivered.",
        "post_score": 0,
        "post_id": "1deio7u",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deio7u/message_to_gc_with_androids_says_not_delivered/",
        "post_numComments": 1,
        "post_dateTime": "2024-06-12 23:54:01",
        "post_text": "The last few days in my family group chat that is a mix of iPhones and androids, my messages will say not delivered with an exclamation point, but they clearly are being delivered because people are responding to me. Anyone know what could be going on/how to fix this?",
        "post_comments": [
            {
                "comment_id": "l8jzcmp",
                "comment_body": "Probably an issue with the android side of things. Apple devices don't play well with Samsung ones and vice versa.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:09:23",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "“You have an AirTag on you” notification made me freak out.",
        "post_score": 73,
        "post_id": "1dei1kg",
        "post_url": "https://i.redd.it/8ypoc2xsk76d1.jpeg",
        "post_numComments": 48,
        "post_dateTime": "2024-06-12 23:26:34",
        "post_text": "I received this notification today (my phone settings are in Spanish) and it made me freak out because I never owned a an AirTag, I just moved to a new place and my ex boyfriend was a stalker. How come I get this? Please u need some reasonable explanation. I checked everything in my place and I don’t have any AirTag. I find this super creepy and I’m actually scared because the notification says that the AirTag is literally on me. Please I need answers.",
        "post_comments": [
            {
                "comment_id": "l8c1pgo",
                "comment_body": "I found an air tag in a used truck I bought last week. I just took it apart took the battery out and threw it in a random dumpster. You should have a option to play a sound",
                "comment_author": "longster37",
                "comment_dateTime": "2024-06-12 23:43:33",
                "comment_score": 43,
                "replies": [
                    {
                        "comment_id": "l8c26oa",
                        "comment_body": "So air tags connect to any random iPhone they find? Genuine question",
                        "comment_author": "muchoblablabla95",
                        "comment_dateTime": "2024-06-12 23:46:23",
                        "comment_score": 20,
                        "replies": [
                            {
                                "comment_id": "l8cizsu",
                                "comment_body": "That’s how they know where they are, since they don’t have GPS they ask nearby iPhones where they are, kinda like a blind person who’s lost",
                                "comment_author": "LambbbSauce",
                                "comment_dateTime": "2024-06-13 01:33:06",
                                "comment_score": 74,
                                "replies": [
                                    {
                                        "comment_id": "l8dbz7y",
                                        "comment_body": "And maybe more to the point of the question, identifying itself is a feature that Apple added to make sure their product would not be (or would be harder to be) used for nefarious tracking purposes. Basically, if an airtag that is not yours has been following you for a while and not with the owner of the air tag, you’ll get a notification so as to suggest someone might be trying to track you.",
                                        "comment_author": "1983Targa911",
                                        "comment_dateTime": "2024-06-13 04:47:28",
                                        "comment_score": 17,
                                        "replies": [
                                            {
                                                "comment_id": "l8g3z2b",
                                                "comment_body": "So what happens if you are on an airplane with several on luggage?",
                                                "comment_author": "UnenthusiasticAddict",
                                                "comment_dateTime": "2024-06-13 18:32:04",
                                                "comment_score": 2,
                                                "replies": [
                                                    {
                                                        "comment_id": "l8g4b2i",
                                                        "comment_body": "It won’t start alerting immediately. There’s a delay so as to not cause nuisance notifications. I’m not sure the exact delay and I think it is randomized a bit to law it harder to game, but I think it’s generally longer than 24 hours.",
                                                        "comment_author": "1983Targa911",
                                                        "comment_dateTime": "2024-06-13 18:33:56",
                                                        "comment_score": 7,
                                                        "replies": [
                                                            {
                                                                "comment_id": "l8g4ysx",
                                                                "comment_body": "Ok thank you for the fast response!",
                                                                "comment_author": "UnenthusiasticAddict",
                                                                "comment_dateTime": "2024-06-13 18:37:35",
                                                                "comment_score": 2,
                                                                "replies": []
                                                            },
                                                            {
                                                                "comment_id": "l8gqzvq",
                                                                "comment_body": "And for long trips you’ll probably get a notification like this, especially if someone in your own group has an AirTag.",
                                                                "comment_author": "navjot94",
                                                                "comment_dateTime": "2024-06-13 20:40:37",
                                                                "comment_score": 1,
                                                                "replies": []
                                                            }
                                                        ]
                                                    },
                                                    {
                                                        "comment_id": "l8w4txf",
                                                        "comment_body": "I removed the sound thing just in case for my luggage AirTag",
                                                        "comment_author": "GreenLiving2864",
                                                        "comment_dateTime": "2024-06-16 20:23:07",
                                                        "comment_score": 2,
                                                        "replies": []
                                                    }
                                                ]
                                            }
                                        ]
                                    },
                                    {
                                        "comment_id": "l8ef3qe",
                                        "comment_body": "More like \"hey random iphone, tell everyone where I am\"",
                                        "comment_author": "Sulya_be",
                                        "comment_dateTime": "2024-06-13 11:15:10",
                                        "comment_score": 7,
                                        "replies": [
                                            {
                                                "comment_id": "l8ft24z",
                                                "comment_body": "Only if that random iPhone is being “followed” by said AirTag. If it’s just passing by it doesn’t let the other phone user know",
                                                "comment_author": "doob22",
                                                "comment_dateTime": "2024-06-13 17:31:37",
                                                "comment_score": 1,
                                                "replies": [
                                                    {
                                                        "comment_id": "l8ftii5",
                                                        "comment_body": "Nope, you're missing airtag detection and airtag functionality.\nWhen iphone sees an airtag it sends it's location to the apple servers.\nWhen iphone keeps seeing the airtag for prolonged time- it gives you this popup",
                                                        "comment_author": "Sulya_be",
                                                        "comment_dateTime": "2024-06-13 17:34:08",
                                                        "comment_score": 5,
                                                        "replies": [
                                                            {
                                                                "comment_id": "l8fxxhc",
                                                                "comment_body": "Well you said “tell everyone where I am” and that’s not true. I was saying the only time others know “where” it is is if it’s following an iPhone for a bit",
                                                                "comment_author": "doob22",
                                                                "comment_dateTime": "2024-06-13 17:58:24",
                                                                "comment_score": 2,
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            },
                            {
                                "comment_id": "l8c2cf6",
                                "comment_body": "Yes if it notified on your phones it should make a sounds. It’s very dangerous. Find it asap",
                                "comment_author": "longster37",
                                "comment_dateTime": "2024-06-12 23:47:19",
                                "comment_score": 11,
                                "replies": []
                            },
                            {
                                "comment_id": "l8ceud8",
                                "comment_body": "Yes that’s how they work. I’ve gotten these before ( I live in A apartment so you could see how it can sometimes happen.",
                                "comment_author": "A_Moon_Named_Luna",
                                "comment_dateTime": "2024-06-13 01:06:07",
                                "comment_score": 5,
                                "replies": []
                            },
                            {
                                "comment_id": "l8et184",
                                "comment_body": "About 10s of googling reveals that to be true.",
                                "comment_author": "andyhenault",
                                "comment_dateTime": "2024-06-13 13:35:26",
                                "comment_score": 2,
                                "replies": []
                            },
                            {
                                "comment_id": "l8hcs7l",
                                "comment_body": "Yes, this is BY DESIGN! If you ever get this notification, that means that you are connected to a nearby AirTag… Could be your boyfriend’s, could be your neighbor’s.",
                                "comment_author": "sethbrown321",
                                "comment_dateTime": "2024-06-13 22:40:29",
                                "comment_score": 1,
                                "replies": []
                            },
                            {
                                "comment_id": "l8vmqpe",
                                "comment_body": "Not really but they use others iPhones/iPads/Macbooks/Apple Watches to wide the detecting distance and there’s an option where the iPhone can detect if an AirTag or AirPod that isn’t yours is following you",
                                "comment_author": "Fun-Zombie3447",
                                "comment_dateTime": "2024-06-16 18:30:02",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    },
                    {
                        "comment_id": "l8w4ehc",
                        "comment_body": "They actually do play a sound after x hours away BUUUUT people have been removing it to use on luggage so on a long trip it wouldn’t start beeping like crazy in the middle of a flight ooooooor to stalk other people unfortunately.\nAlso you could’ve just take that AirTag to the police to find out who put in on your truck in case it was your ex and file something against him…",
                        "comment_author": "GreenLiving2864",
                        "comment_dateTime": "2024-06-16 20:20:28",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8c6wfl",
                "comment_body": "Read more here: https://support.apple.com/en-us/119874",
                "comment_author": "alvinek",
                "comment_dateTime": "2024-06-13 00:15:16",
                "comment_score": 34,
                "replies": [
                    {
                        "comment_id": "l8ca2gc",
                        "comment_body": "Thank you so much x",
                        "comment_author": "muchoblablabla95",
                        "comment_dateTime": "2024-06-13 00:35:27",
                        "comment_score": 7,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8edo0z",
                "comment_body": "n o m o l e s t a r",
                "comment_author": "MarkAssBrownieHD",
                "comment_dateTime": "2024-06-13 10:57:35",
                "comment_score": 8,
                "replies": [
                    {
                        "comment_id": "l91om8h",
                        "comment_body": "What did Lestar ever do to you?",
                        "comment_author": "RulerK",
                        "comment_dateTime": "2024-06-17 21:34:42",
                        "comment_score": 2,
                        "replies": [
                            {
                                "comment_id": "l93v69p",
                                "comment_body": "lmao",
                                "comment_author": "MarkAssBrownieHD",
                                "comment_dateTime": "2024-06-18 05:58:49",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8bz4ya",
                "comment_body": "You need to be contacting the local police department not us. I’m so serious if you are. That is very scary",
                "comment_author": "BigSmoke2023",
                "comment_dateTime": "2024-06-12 23:28:17",
                "comment_score": 29,
                "replies": []
            },
            {
                "comment_id": "l8c0h3s",
                "comment_body": "Try to find it first",
                "comment_author": "TestFlightBeta",
                "comment_dateTime": "2024-06-12 23:36:15",
                "comment_score": 6,
                "replies": []
            },
            {
                "comment_id": "l8c0lnj",
                "comment_body": "Is there no option to play a sound on the AirTag?",
                "comment_author": "error-the-reddit-boi",
                "comment_dateTime": "2024-06-12 23:36:59",
                "comment_score": 12,
                "replies": [
                    {
                        "comment_id": "l8dgtjh",
                        "comment_body": "There is if you click the notification and open the Find My app.",
                        "comment_author": "Reach-for-the-sky_15",
                        "comment_dateTime": "2024-06-13 05:21:54",
                        "comment_score": 11,
                        "replies": []
                    },
                    {
                        "comment_id": "l8cfed1",
                        "comment_body": "There is but it’s easy to take the speakers out",
                        "comment_author": "CactusSurfing",
                        "comment_dateTime": "2024-06-13 01:09:44",
                        "comment_score": 8,
                        "replies": [
                            {
                                "comment_id": "l8era6i",
                                "comment_body": "Next version should have some kind of check such that critical circuit passes through speaker. So that if you take it out, it disabled it.",
                                "comment_author": "mxforest",
                                "comment_dateTime": "2024-06-13 13:20:14",
                                "comment_score": 2,
                                "replies": [
                                    {
                                        "comment_id": "l8flpkr",
                                        "comment_body": "Yes, they should....now if i steal a bike i just play the sound, toss the tag and roll on happy. Nice feature! /s",
                                        "comment_author": "Resident_Honeydew595",
                                        "comment_dateTime": "2024-06-13 16:50:14",
                                        "comment_score": 2,
                                        "replies": [
                                            {
                                                "comment_id": "l8flw6t",
                                                "comment_body": "Sound cannot be played right away. There is a several hour delay.",
                                                "comment_author": "mxforest",
                                                "comment_dateTime": "2024-06-13 16:51:16",
                                                "comment_score": 0,
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8d20a3",
                "comment_body": "Do these alert android phones too? These things are scary.",
                "comment_author": "releasethedogs",
                "comment_dateTime": "2024-06-13 03:40:23",
                "comment_score": 5,
                "replies": [
                    {
                        "comment_id": "l8dl0lp",
                        "comment_body": "Yeah Google rolled out a Foreign Tracker Detection to Play Services a few months ago. Works with AirTags",
                        "comment_author": "doctortrento",
                        "comment_dateTime": "2024-06-13 05:54:53",
                        "comment_score": 12,
                        "replies": [
                            {
                                "comment_id": "l8j4598",
                                "comment_body": "But to be clear you have to have downloaded the app. I guess that’s better than nothing.",
                                "comment_author": "releasethedogs",
                                "comment_dateTime": "2024-06-14 05:44:17",
                                "comment_score": 1,
                                "replies": [
                                    {
                                        "comment_id": "l8mohtx",
                                        "comment_body": "Play Services is integrated into every Android phone that's shipped with access to Google services since like 2014.",
                                        "comment_author": "doctortrento",
                                        "comment_dateTime": "2024-06-14 21:57:59",
                                        "comment_score": 1,
                                        "replies": [
                                            {
                                                "comment_id": "l8nk7cz",
                                                "comment_body": "Sweet!",
                                                "comment_author": "releasethedogs",
                                                "comment_dateTime": "2024-06-15 01:17:28",
                                                "comment_score": 1,
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8h5i02",
                "comment_body": "The funny thing is I get this warning all the time and they are my own AirTags. Kind of get desensitized because of that.",
                "comment_author": "GreatValueProducts",
                "comment_dateTime": "2024-06-13 22:00:36",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8cg0uh",
                "comment_body": "Revisa tus cosas",
                "comment_author": "GatoMax",
                "comment_dateTime": "2024-06-13 01:13:48",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8fhvqt",
                "comment_body": "Do you live in an apartment or close proximity to neighbors?  Could be picking up something like that 🤷‍♂️",
                "comment_author": "xxirish83x",
                "comment_dateTime": "2024-06-13 16:28:03",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8g5126",
                "comment_body": "lo siento pero necesito saber donde estas",
                "comment_author": "kinstinctlol",
                "comment_dateTime": "2024-06-13 18:37:57",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8hgoy5",
                "comment_body": "What is\nAir tag",
                "comment_author": "AdSpecialist5496",
                "comment_dateTime": "2024-06-13 23:01:58",
                "comment_score": 0,
                "replies": []
            },
            {
                "comment_id": "l8ed40h",
                "comment_body": "Have you checked your underpants",
                "comment_author": "Sempot",
                "comment_dateTime": "2024-06-13 10:50:45",
                "comment_score": -10,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Apple Watch and iPhone 15pm alarm not syncing",
        "post_score": 1,
        "post_id": "1dehwy0",
        "post_url": "/r/AppleWatch/comments/1dehvrz/apple_watch_and_iphone_15pm_alarm_not_syncing/",
        "post_numComments": 0,
        "post_dateTime": "2024-06-12 23:21:00",
        "post_text": "",
        "post_comments": []
    },
    {
        "post_title": "Mysterious glitch?",
        "post_score": 0,
        "post_id": "1degu4a",
        "post_url": "https://www.reddit.com/r/iphone/comments/1degu4a/mysterious_glitch/",
        "post_numComments": 1,
        "post_dateTime": "2024-06-12 22:35:21",
        "post_text": "Earlier today my phone was completely normal, then it died and when it restarted some WEIRD shit happened. \nFirst thing I noticed was my iMessages were completely messed up. My recents have been moved around completely, and my most recently texted numbers have been replaced by messages I haven’t seen since 2023?\nGroup chats, and ex, and parents of ex all were moved to my recents when I haven’t replied to them since 2023. \n\nSecond i got a notification from Facebook that a listing of mine had been renewed. It had been renewed around the time my phone turned back on. I didn’t renew it. I actually deleted it last year. \n\nLastly- none of my apps are working at proper speed. Super slow loading times, or just not working at all is the best way I could put it. \n\nWhat do?",
        "post_comments": [
            {
                "comment_id": "l8jzhv2",
                "comment_body": "Call support. Ur phone is crying out for help.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:11:10",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Why is the option for the IOS beta update not showing up for me?",
        "post_score": 0,
        "post_id": "1deg7xb",
        "post_url": "https://i.redd.it/y07imc02776d1.jpeg",
        "post_numComments": 11,
        "post_dateTime": "2024-06-12 22:09:36",
        "post_text": "",
        "post_comments": [
            {
                "comment_id": "l8bm6qe",
                "comment_body": "are you a developer?",
                "comment_author": "toobsock2",
                "comment_dateTime": "2024-06-12 22:15:26",
                "comment_score": 11,
                "replies": []
            },
            {
                "comment_id": "l8bmryj",
                "comment_body": "You need to sign up as an Apple developer",
                "comment_author": "britelitees",
                "comment_dateTime": "2024-06-12 22:18:39",
                "comment_score": 9,
                "replies": []
            },
            {
                "comment_id": "l8bqd3y",
                "comment_body": "signed up developer or using iPhone X?",
                "comment_author": "trbatuhankara",
                "comment_dateTime": "2024-06-12 22:38:33",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8bx4il",
                "comment_body": "If you already signed up, restart your phone and it should show up",
                "comment_author": "mutedtulips",
                "comment_dateTime": "2024-06-12 23:16:32",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8bys9w",
                "comment_body": "Currently there are no iOS 17 public betas.\n\nChange from iOS 17 Public Beta to iOS 18 Developer Beta if you are a developer.\n\nhttps://preview.redd.it/afhhx1rnk76d1.jpeg?width=1179&format=pjpg&auto=webp&s=9e216ec76c2480dfc6a3dddbbf20e5070dabffef\n\nIf you busy want iOS 18, wait until the public beta is available in July.",
                "comment_author": "James_Atlanta",
                "comment_dateTime": "2024-06-12 23:26:14",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8c0xk8",
                "comment_body": "You need to sign up for a free Developer Account to get the Developer Betas (you don’t need the paid Developer Program). You can sign up in a few seconds in the [Apple Developer app](https://apps.apple.com/us/app/apple-developer/id640199958) under the Account tab",
                "comment_author": "Appropriate_Salad968",
                "comment_dateTime": "2024-06-12 23:38:58",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8bnaj4",
                "comment_body": "The public beta hasn’t been released yet. It will be available in July. The people who have it now paid for a developer account.",
                "comment_author": "0000GKP",
                "comment_dateTime": "2024-06-12 22:21:32",
                "comment_score": -3,
                "replies": [
                    {
                        "comment_id": "l8bnwh4",
                        "comment_body": "The Developer Betas are also available for non-paid developer accounts. Apple changed it last year",
                        "comment_author": "Appropriate_Salad968",
                        "comment_dateTime": "2024-06-12 22:24:55",
                        "comment_score": 10,
                        "replies": [
                            {
                                "comment_id": "l8bt8d4",
                                "comment_body": "The only right comment in here, which makes the fact that the option doesn't show to the OP even stranger.",
                                "comment_author": "the_zel",
                                "comment_dateTime": "2024-06-12 22:54:23",
                                "comment_score": 3,
                                "replies": [
                                    {
                                        "comment_id": "l8c0dpt",
                                        "comment_body": "You still have to sign up for a Developer Account, it’s free, gives you access to the Developer Betas, and different from the paid Developer Program.",
                                        "comment_author": "Appropriate_Salad968",
                                        "comment_dateTime": "2024-06-12 23:35:41",
                                        "comment_score": 1,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Question",
        "post_score": 1,
        "post_id": "1deg7nw",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deg7nw/question/",
        "post_numComments": 1,
        "post_dateTime": "2024-06-12 22:09:17",
        "post_text": "I have an iPhone 15 currently,I want to know how can I transfer my data to an iPhone 12 for example I want to have service would I have eSIM?\n#question",
        "post_comments": [
            {
                "comment_id": "l8jzolx",
                "comment_body": "Shouldn't be an issue using migration but the carrier eill probably have to setup a physical sim unless the 12 does support esim at this time. I can't look it up atm XD.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:13:25",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Mass Texting",
        "post_score": 1,
        "post_id": "1defvqd",
        "post_url": "https://www.reddit.com/r/iphone/comments/1defvqd/mass_texting/",
        "post_numComments": 1,
        "post_dateTime": "2024-06-12 21:55:46",
        "post_text": "One of the recent iOS updates got rid of the option to turn off group texting. For the past couple months, I've been toggling off \"MMS texting\" when I need to send a mass text. However, now, when I toggle off MMS texting, I can't send a text.\n\nAny work-arounds for this? Might Apple ever return the \"group texting\" feature? What do you use to send mass texts, without creating group texts? Any free apps for this?\n\nI'd like to send mass texts without lumping 30 people that don't know each other in a group together. Nobody wants that.",
        "post_comments": [
            {
                "comment_id": "l8jztrd",
                "comment_body": "Probably call ur carrier.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:15:07",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Can anyone explain!",
        "post_score": 278,
        "post_id": "1defpb7",
        "post_url": "https://i.redd.it/esmy7n3a376d1.jpeg",
        "post_numComments": 61,
        "post_dateTime": "2024-06-12 21:48:21",
        "post_text": "I know it might be a very amateurish question 🙈…..  but does anyone know why it’s says “tomorrow” next to the charging symbol ?",
        "post_comments": [
            {
                "comment_id": "l8cci2n",
                "comment_body": "Last seen tomorrow! Did you recently fly across a bunch of time zones?",
                "comment_author": "Eric848448",
                "comment_dateTime": "2024-06-13 00:51:03",
                "comment_score": 98,
                "replies": []
            },
            {
                "comment_id": "l8bl2zy",
                "comment_body": "Tomorrow 👍",
                "comment_author": "UglyWigglyBallz",
                "comment_dateTime": "2024-06-12 22:09:22",
                "comment_score": 613,
                "replies": [
                    {
                        "comment_id": "l8br7hw",
                        "comment_body": "Tomorrow battery will be low. Apple intelligence spitting out some facts lol.",
                        "comment_author": "No-Job-4431",
                        "comment_dateTime": "2024-06-12 22:43:13",
                        "comment_score": 322,
                        "replies": [
                            {
                                "comment_id": "l8c47cq",
                                "comment_body": "[Tomorrow!](https://m.youtube.com/watch?v=6PtdpI-D6mM&cbrd=1)",
                                "comment_author": "DJ-WS",
                                "comment_dateTime": "2024-06-12 23:58:30",
                                "comment_score": 26,
                                "replies": [
                                    {
                                        "comment_id": "l8eclhk",
                                        "comment_body": "¯\\\\\\_(ツ)\\_/¯",
                                        "comment_author": "MacAppster87",
                                        "comment_dateTime": "2024-06-13 10:44:31",
                                        "comment_score": 8,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "l8eyyax",
                        "comment_body": "Apple Intelligence. It shows the device has sufficient battery life to last until tomorrow. Instead of showing an exact percentage, it estimates how long the battery is expected to last based on current usage patterns and displays this information more intuitively. But personally, I prefer the exact percentage.😂",
                        "comment_author": "super_daisy_03",
                        "comment_dateTime": "2024-06-13 14:22:55",
                        "comment_score": 12,
                        "replies": []
                    },
                    {
                        "comment_id": "l8fijya",
                        "comment_body": "r/skamtebord",
                        "comment_author": "Salt_Blackberry_1903",
                        "comment_dateTime": "2024-06-13 16:31:59",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8ctw6q",
                "comment_body": "- How much battery do you have?\n\n• Tomorrow%.",
                "comment_author": "_Pilotamente_077_",
                "comment_dateTime": "2024-06-13 02:45:48",
                "comment_score": 198,
                "replies": [
                    {
                        "comment_id": "l8degqg",
                        "comment_body": ">Tomorrow%\n\nSounds like a speedrun category",
                        "comment_author": "AbdullahMRiad",
                        "comment_dateTime": "2024-06-13 05:04:37",
                        "comment_score": 34,
                        "replies": []
                    },
                    {
                        "comment_id": "l8fdmbf",
                        "comment_body": "But I asked today!",
                        "comment_author": "Tattycakes",
                        "comment_dateTime": "2024-06-13 16:02:33",
                        "comment_score": 1,
                        "replies": []
                    },
                    {
                        "comment_id": "l8d8vgo",
                        "comment_body": "Lmfao",
                        "comment_author": "Steelmack",
                        "comment_dateTime": "2024-06-13 04:26:19",
                        "comment_score": 0,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8c4jie",
                "comment_body": "It’s in the future",
                "comment_author": "Careless_Conflict581",
                "comment_dateTime": "2024-06-13 00:00:33",
                "comment_score": 99,
                "replies": [
                    {
                        "comment_id": "l8cgq8o",
                        "comment_body": "That Apple Intelligence",
                        "comment_author": "Luna259",
                        "comment_dateTime": "2024-06-13 01:18:25",
                        "comment_score": 33,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8c0pp3",
                "comment_body": "Maybe different time zone",
                "comment_author": "cyberspirit777",
                "comment_dateTime": "2024-06-12 23:37:40",
                "comment_score": 55,
                "replies": [
                    {
                        "comment_id": "l8e93zf",
                        "comment_body": "Ugh. Reset the counter!\n\n**IT HAS BEEN** -1 **DAYS SINCE OUR LAST TIMEZONE ISSUE**",
                        "comment_author": "toholio",
                        "comment_dateTime": "2024-06-13 10:01:55",
                        "comment_score": 30,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8cq6hl",
                "comment_body": "Sounds like where your phone is is in the future (different time zone)",
                "comment_author": "iAdden",
                "comment_dateTime": "2024-06-13 02:21:03",
                "comment_score": 17,
                "replies": []
            },
            {
                "comment_id": "l8diiyz",
                "comment_body": "Your phone does not exist today. It is already in tomorrow.",
                "comment_author": "ennisi",
                "comment_dateTime": "2024-06-13 05:35:04",
                "comment_score": 12,
                "replies": []
            },
            {
                "comment_id": "l8ddh4x",
                "comment_body": "What app is that? Doesn't look like \"find my\"",
                "comment_author": "planting49",
                "comment_dateTime": "2024-06-13 04:57:54",
                "comment_score": 5,
                "replies": [
                    {
                        "comment_id": "l8ec8jr",
                        "comment_body": "Find my website on pc",
                        "comment_author": "Carlazor_",
                        "comment_dateTime": "2024-06-13 10:40:08",
                        "comment_score": 8,
                        "replies": [
                            {
                                "comment_id": "l8en58g",
                                "comment_body": "What's your website?",
                                "comment_author": "Tumleren",
                                "comment_dateTime": "2024-06-13 12:41:05",
                                "comment_score": 20,
                                "replies": [
                                    {
                                        "comment_id": "l8epnp8",
                                        "comment_body": "No I meant apple's find my website, not my website, Apple's find my website is [this](http://iCloud.com/find)",
                                        "comment_author": "Carlazor_",
                                        "comment_dateTime": "2024-06-13 13:05:30",
                                        "comment_score": 10,
                                        "replies": [
                                            {
                                                "comment_id": "l8eqezx",
                                                "comment_body": "I'm just joking, sorry",
                                                "comment_author": "Tumleren",
                                                "comment_dateTime": "2024-06-13 13:12:28",
                                                "comment_score": 16,
                                                "replies": []
                                            },
                                            {
                                                "comment_id": "l8f2ny9",
                                                "comment_body": "But what IS your website?",
                                                "comment_author": "CSDNews",
                                                "comment_dateTime": "2024-06-13 14:50:17",
                                                "comment_score": 7,
                                                "replies": [
                                                    {
                                                        "comment_id": "l8h47rv",
                                                        "comment_body": "Ohh CSD is crustacean daily, I thought it was Christopher street day news.",
                                                        "comment_author": "heyitslila",
                                                        "comment_dateTime": "2024-06-13 21:53:32",
                                                        "comment_score": 0,
                                                        "replies": [
                                                            {
                                                                "comment_id": "l8h4lq9",
                                                                "comment_body": "We have Crustaceans these days? Damn, when did that start?\n\nI can confirm that The Crustian Daily is still doing satirical news, I will keep you posted on the availability of crustaceans.",
                                                                "comment_author": "CSDNews",
                                                                "comment_dateTime": "2024-06-13 21:55:39",
                                                                "comment_score": 2,
                                                                "replies": []
                                                            }
                                                        ]
                                                    }
                                                ]
                                            },
                                            {
                                                "comment_id": "l8fks5l",
                                                "comment_body": "Apple found your website, not your website? what?",
                                                "comment_author": "rresende",
                                                "comment_dateTime": "2024-06-13 16:44:54",
                                                "comment_score": 6,
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8c6dxm",
                "comment_body": "The battery will last until tomorrow.",
                "comment_author": "ProbablyProdigy",
                "comment_dateTime": "2024-06-13 00:12:01",
                "comment_score": 17,
                "replies": []
            },
            {
                "comment_id": "l8cemit",
                "comment_body": "Theeeeeeeeeeee sun will come up…..",
                "comment_author": "CYPH3R_22",
                "comment_dateTime": "2024-06-13 01:04:42",
                "comment_score": 10,
                "replies": [
                    {
                        "comment_id": "l8gzxvj",
                        "comment_body": "I cant wait to get back on the road again?",
                        "comment_author": "Fuckyousnow",
                        "comment_dateTime": "2024-06-13 21:29:53",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8dbv7p",
                "comment_body": "r/tomorrow",
                "comment_author": "Regular_Ship2073",
                "comment_dateTime": "2024-06-13 04:46:42",
                "comment_score": 6,
                "replies": [
                    {
                        "comment_id": "l8eem2b",
                        "comment_body": "it's a hidden gem",
                        "comment_author": "fill-me-up-scotty",
                        "comment_dateTime": "2024-06-13 11:09:13",
                        "comment_score": 3,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8dxh20",
                "comment_body": "It means charge now or your phone will die tomorrow",
                "comment_author": "russbeast0",
                "comment_dateTime": "2024-06-13 07:50:24",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8e3vgf",
                "comment_body": "Bet your bottom dollar that tomorrow…..",
                "comment_author": "Cyborg9898",
                "comment_dateTime": "2024-06-13 08:59:52",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8fo0zq",
                "comment_body": "If you are seeing this today then there will be tomorrow.\n\nIf you are not seeing it tomorrow, tomorrow. then ur phone is probably dead - Apple intelligence",
                "comment_author": "Strombreaker55",
                "comment_dateTime": "2024-06-13 17:03:25",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8gcff4",
                "comment_body": "Mark as Lost its goddamn mind",
                "comment_author": "anamazingredditor",
                "comment_dateTime": "2024-06-13 19:18:42",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8ditk6",
                "comment_body": "All jokes aside. I think it might possibly be giving you the estimated battery life of the iPhone. Just a guess.",
                "comment_author": "Ok-Potential791",
                "comment_dateTime": "2024-06-13 05:37:20",
                "comment_score": 4,
                "replies": []
            },
            {
                "comment_id": "l8cjqao",
                "comment_body": "Toyota",
                "comment_author": "venusunusis",
                "comment_dateTime": "2024-06-13 01:37:52",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8cwrzt",
                "comment_body": "Tomato",
                "comment_author": "NoAge422",
                "comment_dateTime": "2024-06-13 03:05:04",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8diti2",
                "comment_body": "Tomorrow.",
                "comment_author": "Commercial-Ad-3023",
                "comment_dateTime": "2024-06-13 05:37:19",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8eauqj",
                "comment_body": "Time travel.",
                "comment_author": "ECR_Savory",
                "comment_dateTime": "2024-06-13 10:23:03",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8f4k3n",
                "comment_body": "Your phone has now gained the skill of clairvoyance.\n\nTomorrow will be low and filled with difficulties",
                "comment_author": "SurealGod",
                "comment_dateTime": "2024-06-13 15:03:35",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8f6xyv",
                "comment_body": "I’ve heard of people having bugs where it shows a date in the future. \n\nFor example, if you edit a PDF, it will say you edited someone in the future. I’m assuming it’s the same bug here, where it’s showing the last time the battery level way updated.",
                "comment_author": "KvassKludge9001",
                "comment_dateTime": "2024-06-13 15:19:44",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8fwojt",
                "comment_body": "Tomorrow 🫡",
                "comment_author": "low-key1105",
                "comment_dateTime": "2024-06-13 17:51:35",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8g4ato",
                "comment_body": "Although it seems there is not much battery left, thanks to Apple Intelligence, your iPhone keeps till tomorrow.",
                "comment_author": "nkyst",
                "comment_dateTime": "2024-06-13 18:33:54",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8g98ai",
                "comment_body": "🎶🎶🎼The battery will be depleted... Tomorrow, bet your bottom plug.that tomorrow...you'll need a charge. 🎵🎵",
                "comment_author": "Wonderful-Arm-7780",
                "comment_dateTime": "2024-06-13 19:00:54",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8gt451",
                "comment_body": "that's usually showing the time that this battery level was detected. Might be a timezone issue where the device is somewhere ahead of the time zone you are in.",
                "comment_author": "navjot94",
                "comment_dateTime": "2024-06-13 20:52:09",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8gwbhk",
                "comment_body": "Ask for someone to remove it in r/TweakBounty",
                "comment_author": "DonutvibesYT",
                "comment_dateTime": "2024-06-13 21:09:52",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8hygda",
                "comment_body": "Did you buy the Apple battery package upgrade? It's $2.99/mo and Apple tells you your battery level. Otherwise it's none of your business.",
                "comment_author": "Clienterror",
                "comment_dateTime": "2024-06-14 00:50:05",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ig6iw",
                "comment_body": "Maybe how long the battery until?",
                "comment_author": "seniszen",
                "comment_dateTime": "2024-06-14 02:49:40",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8k9f9o",
                "comment_body": "That’s cause the last time that your iPhone was localized was tomorrow 🙏🏼",
                "comment_author": "Fun-Zombie3447",
                "comment_dateTime": "2024-06-14 12:59:49",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8l242k",
                "comment_body": "Didn’t your pc has wrong time set?",
                "comment_author": "Infamous_Munky",
                "comment_dateTime": "2024-06-14 16:26:35",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8x5m4x",
                "comment_body": "At some point tomorrow your battery will have this much charge.  Can't tell exactly when, but it will be sometime tomorrow.",
                "comment_author": "JerryVand",
                "comment_dateTime": "2024-06-17 00:17:14",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ed8kq",
                "comment_body": "clock is most likely off, on soundcloud occasionally it tells me that someone posted a song tomorrow",
                "comment_author": "squabbledMC",
                "comment_dateTime": "2024-06-13 10:52:20",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ehfef",
                "comment_body": "The iphone escaped the matrix. 👍",
                "comment_author": "Gustavo_Picasso",
                "comment_dateTime": "2024-06-13 11:38:18",
                "comment_score": 0,
                "replies": []
            },
            {
                "comment_id": "l8ezk4v",
                "comment_body": "r/tomorrow",
                "comment_author": "SnooPies6424",
                "comment_dateTime": "2024-06-13 14:27:30",
                "comment_score": 0,
                "replies": []
            },
            {
                "comment_id": "l8c5p91",
                "comment_body": "Prolly smth to do with ur date and time settings",
                "comment_author": "No_Firefighter_7126",
                "comment_dateTime": "2024-06-13 00:07:44",
                "comment_score": -1,
                "replies": []
            },
            {
                "comment_id": "l8cg453",
                "comment_body": "How do i get the beta?",
                "comment_author": "Oblitus_Ingenium",
                "comment_dateTime": "2024-06-13 01:14:23",
                "comment_score": 0,
                "replies": [
                    {
                        "comment_id": "l8dli7s",
                        "comment_body": "Pay a hundred bucks.",
                        "comment_author": "cruebob",
                        "comment_dateTime": "2024-06-13 05:58:54",
                        "comment_score": 1,
                        "replies": []
                    },
                    {
                        "comment_id": "l8cq9g1",
                        "comment_body": "Dev profile",
                        "comment_author": "iAdden",
                        "comment_dateTime": "2024-06-13 02:21:35",
                        "comment_score": 0,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8esmgj",
                "comment_body": "High",
                "comment_author": "Any_Photograph9289",
                "comment_dateTime": "2024-06-13 13:31:57",
                "comment_score": 0,
                "replies": []
            },
            {
                "comment_id": "l8fuph4",
                "comment_body": "Are you a time traveler ?",
                "comment_author": "Silly_Cost6608",
                "comment_dateTime": "2024-06-13 17:40:45",
                "comment_score": 0,
                "replies": []
            }
        ]
    },
    {
        "post_title": "My iPhone won’t let me update it",
        "post_score": 1,
        "post_id": "1def7ey",
        "post_url": "https://i.redd.it/c94nj2cjz66d1.jpeg",
        "post_numComments": 4,
        "post_dateTime": "2024-06-12 21:27:23",
        "post_text": "",
        "post_comments": [
            {
                "comment_id": "l8bhi8w",
                "comment_body": "Restart your phone or turn on airplane mode and turn it off back",
                "comment_author": "Papabelus",
                "comment_dateTime": "2024-06-12 21:49:43",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8jzzy1",
                "comment_body": "Update through pc using iTunes or a mac.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:17:09",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8busj4",
                "comment_body": "If you have a VPN on make sure it’s off for updates",
                "comment_author": "creaperboy",
                "comment_dateTime": "2024-06-12 23:03:08",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8bj3tc",
                "comment_body": "Your phone hates you",
                "comment_author": "UglyWigglyBallz",
                "comment_dateTime": "2024-06-12 21:58:23",
                "comment_score": 0,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Issues with VoLTE on iPhone 12 Pro Max",
        "post_score": 1,
        "post_id": "1deepvr",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deepvr/issues_with_volte_on_iphone_12_pro_max/",
        "post_numComments": 0,
        "post_dateTime": "2024-06-12 21:07:03",
        "post_text": "Hi everyone,\n\nI've recently been experiencing a frustrating issue with my iPhone 12 Pro Max. I'm in Italy and my carrier is Vodafone. Whenever I make a call to any contact in my phonebook, my mobile internet (4G/5G) disconnects automatically, preventing me from using the internet while on a call.\n\nThis problem has been occurring for about a month now. I've contacted Vodafone's customer service, and every representative suggests that I enable the VoLTE feature on my iPhone. According to online guides, this option should be found at: Settings > Cellular > Cellular Data Options > Voice & Data, and then enable *VoLTE*. However, **when I access the** ***Voice & Data*** **menu, I don't see an option to enable** ***VoLTE*****.**\n\nI recall seeing this option in the past, but after the recent updates, it's no longer visible. From what I've read online, it seems that VoLTE should be enabled by default on all iPhones with the latest iOS updates.  \n**I currently have iOS 17.5.1 installed.**\n\nI'm stuck because if I keep calling Vodafone, they continue to insist it's an issue with my phone, claiming there's nothing they can do from their end. Meanwhile, I can't enable VoLTE because iOS *supposedly already has it enabled by default*, which I find doubtful.\n\nHas anyone else experienced a similar issue? Any advice on how to resolve this situation would be greatly appreciated. I'm in desperate need of help.\n\n**Thanks in advance!**\n\n[No VoLTE option in the Voice & Data menu](https://preview.redd.it/w8uqb1ysv66d1.jpg?width=591&format=pjpg&auto=webp&s=1f6cc5c29dd12f8c3bc8df7a28f1a134a2454b90)\n\n",
        "post_comments": []
    },
    {
        "post_title": "All of a sudden all message notifications simply show Messages Notification from known contacts whether phone is locked or not.",
        "post_score": 1,
        "post_id": "1dedy7v",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dedy7v/all_of_a_sudden_all_message_notifications_simply/",
        "post_numComments": 11,
        "post_dateTime": "2024-06-12 20:36:04",
        "post_text": "I made no changes to the settings.  Last night I noticed messages from my friends who are contacts in my phone and who use iphones are notified simply with a note that says Messages Notification instead of with the name of the contact.  What happened and how can I get the contact name to appear again in the notification?\n\nhttps://preview.redd.it/tjmv8v54t66d1.png?width=1170&format=png&auto=webp&s=abe5dab81d9cdda8f169b258f7e08d69ed8e615e\n\n",
        "post_comments": [
            {
                "comment_id": "l8bbddk",
                "comment_body": "Have you checked the notifications settings ? There should be “lock screen appearance”",
                "comment_author": "Roy_90",
                "comment_dateTime": "2024-06-12 21:15:53",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8bd3ld",
                        "comment_body": "I don't see any settings that indicate that they'd obscure the sender's identity either in the general Notification settings or the sub-setting Notification Style of Messages.  Either way, this problem occurs whether the phone is locked or not.",
                        "comment_author": "ValkyrieIsBigger",
                        "comment_dateTime": "2024-06-12 21:25:28",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8beows",
                                "comment_body": "go to Settings > Notifications > Messages > Show Previews and then select Always … or is it already set like that ?",
                                "comment_author": "Roy_90",
                                "comment_dateTime": "2024-06-12 21:34:15",
                                "comment_score": 2,
                                "replies": [
                                    {
                                        "comment_id": "l8bg0ae",
                                        "comment_body": "That worked- thank you!",
                                        "comment_author": "ValkyrieIsBigger",
                                        "comment_dateTime": "2024-06-12 21:41:33",
                                        "comment_score": 1,
                                        "replies": [
                                            {
                                                "comment_id": "l8bidx8",
                                                "comment_body": "you’re welcome 😊",
                                                "comment_author": "Roy_90",
                                                "comment_dateTime": "2024-06-12 21:54:32",
                                                "comment_score": 1,
                                                "replies": []
                                            }
                                        ]
                                    },
                                    {
                                        "comment_id": "l8v7hap",
                                        "comment_body": "I tried it too (I haven't received a Message yet to see if this worked) but I haven't changed the setting from was it was (default (Never)) so something else caused this to start happening within the past day. But thank you for your help!",
                                        "comment_author": "One_Mirror4550",
                                        "comment_dateTime": "2024-06-16 16:51:34",
                                        "comment_score": 1,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8bd9b9",
                "comment_body": "What iPhone do you have ?",
                "comment_author": "Roy_90",
                "comment_dateTime": "2024-06-12 21:26:21",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8bdpn2",
                        "comment_body": "13 Pro running iOS 17.5.1.",
                        "comment_author": "ValkyrieIsBigger",
                        "comment_dateTime": "2024-06-12 21:28:50",
                        "comment_score": 2,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8pf54b",
                "comment_body": "Hey I’m just piggy backing on this thread because it started happening to me too. However, I don’t actually want a message preview to pop up on the Lock Screen - I just want it to say the contact’s name and then “iMessage” like it did before. Now it’s apparently all or nothing and I don’t understand why. I don’t want the actual message body to preview on my Lock Screen, but I also don’t want to have no information at all??",
                "comment_author": "tacocatmarie",
                "comment_dateTime": "2024-06-15 11:52:11",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8v6udq",
                "comment_body": "Same thing happened to me",
                "comment_author": "One_Mirror4550",
                "comment_dateTime": "2024-06-16 16:47:21",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8xoetx",
                "comment_body": "Happening to me also, nothing has changed in my settings.",
                "comment_author": "Wrong_Jelly_5795",
                "comment_dateTime": "2024-06-17 02:32:32",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "iMessage being wonky with only one person",
        "post_score": 1,
        "post_id": "1dedkec",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dedkec/imessage_being_wonky_with_only_one_person/",
        "post_numComments": 1,
        "post_dateTime": "2024-06-12 20:20:37",
        "post_text": "So my messages go green but I'm not blocked cuz he responds to my messages but now it says he laughed at one of my messages but I don't see nothing.. his messages show up but not last night's messages?\n\nI exit & come back & I still get a notification he liked my message but I don't see nothing from him??? ",
        "post_comments": [
            {
                "comment_id": "l8bkxyz",
                "comment_body": "Bad internet on his side maybe?",
                "comment_author": "Grand_Combination_19",
                "comment_dateTime": "2024-06-12 22:08:36",
                "comment_score": 2,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Why does my notifications doesn't disappear when opened on another device?",
        "post_score": 3,
        "post_id": "1dedjpo",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dedjpo/why_does_my_notifications_doesnt_disappear_when/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-12 20:19:51",
        "post_text": "Hi everyone!\n\nI tried to google this, but didn't really find anything useful, just went down some rabbit holes of reading.\n\nSo my issue, when i get a notification and i read it for example on my iphone (11 Pro, iOS 17.5.1) the notification remains on my iPad (9th gen, iPadOS 17.5.1) and my watch (S6, OS 10.5). But why? This was working fine a few months ago, but now I have to open every notification on my phone/tablet/watch again again, or dismiss them...\n\nWhat can I do to resolve this?\n\nUPDATE: Okay, so it seems like the answer was to sing out  with my Apple ID from all of my devices at the same time, once logged out, started logging back in starting on my phone. And now the issue is solved. Everything is working like it supposed to!",
        "post_comments": [
            {
                "comment_id": "l8jyr2e",
                "comment_body": "Check ur notification settings. Update ur phone. Dismiss the notifications if u can't find anything but it sounds like a setting is on.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:02:09",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8khhvf",
                        "comment_body": "I don’t know what’s causing it. Everything is updated, I wrote the current OS builds in the post. This is not strictly a phone issue. For example, last night I was reading on my iPad, received a few notifications Outlook, iMessage, Reddit etc. Opened them, replied to the messages etc. In the morning I’ve checked my phone the notifications were there, and on my watch as well. It’s like they’re not synchronized anymore…. I have to open/dismiss everything on each device.\nEdit: I also use iCloud, and everything is turned on to be synced, so that’s not a problem for sure.",
                        "comment_author": "Opposite_Equal_1756",
                        "comment_dateTime": "2024-06-14 14:08:28",
                        "comment_score": 1,
                        "replies": []
                    },
                    {
                        "comment_id": "l8r4b1y",
                        "comment_body": "Okay, so it seems like the answer was to sing out  with my Apple ID from all of my devices at the same time, once logged out, started logging back in starting on my phone. And now the issue is solved. Everything is working like it supposed to!",
                        "comment_author": "Opposite_Equal_1756",
                        "comment_dateTime": "2024-06-15 20:13:39",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "As useless as it may seem, can restarting your phone several times during the day cause wear or damage?",
        "post_score": 0,
        "post_id": "1dedhjw",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dedhjw/as_useless_as_it_may_seem_can_restarting_your/",
        "post_numComments": 5,
        "post_dateTime": "2024-06-12 20:17:17",
        "post_text": "Just for curiosity.",
        "post_comments": [
            {
                "comment_id": "l8b851q",
                "comment_body": "no, not on any realistic timescale.",
                "comment_author": "Go_F1sh",
                "comment_dateTime": "2024-06-12 20:57:58",
                "comment_score": 4,
                "replies": []
            },
            {
                "comment_id": "l8bmivf",
                "comment_body": "Using it normally also places strain on it and slowly wears out the battery",
                "comment_author": "Grand_Combination_19",
                "comment_dateTime": "2024-06-12 22:17:17",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8b4qnj",
                "comment_body": "It does ask for more strain on the processor, battery and probably storage, but I would not worry if it were done just a few days.",
                "comment_author": "Seawxxxd",
                "comment_dateTime": "2024-06-12 20:39:29",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8bedr1",
                "comment_body": "No. It can’t.",
                "comment_author": "UnwieldilyElephant",
                "comment_dateTime": "2024-06-12 21:32:32",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8cogwp",
                "comment_body": "Yes. You’re causing the whole CPU ect to reboot constantly. Things prefer to be in one state most of the time.",
                "comment_author": "QuickYear8511",
                "comment_dateTime": "2024-06-13 02:09:26",
                "comment_score": 0,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Issues with Wallpaper Sizing",
        "post_score": 4,
        "post_id": "1decyjy",
        "post_url": "https://www.reddit.com/gallery/1decyjy",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 19:55:28",
        "post_text": "I’m experiencing a recurring and irritating issue where wallpapers I create to be rotated in a folder are sometimes resized by my phone even when cropped *specifically* using the wallpaper preset in the photos app. \n\nI have tried using the cropped image directly.\nI have tried just screenshotting the portion of the image I want without cropping.\nI have tried cropping and then screenshotting that cropped photo to create a *brand new* image.\n\nAnd it still just does what it wants to half the time. I’ve attached screenshots of the image as I’m attempting to have it displayed, and then as my wallpaper app *wants* to display it.\n\nAny advice or guidance here would be helpful. Perspective zoom isn’t on, I’ve fiddled with motion settings… has anyone had this issue and found a consistent solution? 🥺",
        "post_comments": [
            {
                "comment_id": "l8bgd6t",
                "comment_body": "Try moving it around by pinching the screen with both fingers.",
                "comment_author": "vishrit",
                "comment_dateTime": "2024-06-12 21:43:31",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8ay5xy",
                "comment_body": "Not sure about your issue but nice wallpaper",
                "comment_author": "Gohan237",
                "comment_dateTime": "2024-06-12 20:03:36",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Is there a reason wireless phone backups from iPhone to PC iTunes are still not possible?",
        "post_score": 1,
        "post_id": "1dectfc",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dectfc/is_there_a_reason_wireless_phone_backups_from/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 19:49:32",
        "post_text": "I can transfer (copy) my entire phone‘s contents to another phone over Wi-Fi. Why can’t this be done from phone to PC/iTunes over the same Wi-Fi network  without a lightning/USB cable?\n\n(I understand wireless backups to iCloud exist, but that comes with a subscription fee for any reasonable amount of data.)\n\nMy phone has a waterproof case, and repeatedly opening the tab covering the charging port eventually wears the case down, degrading its waterproofing. With wireless charging, I typically never need to take off my case.\n\nDoes anyone know of any workarounds? ",
        "post_comments": [
            {
                "comment_id": "l8azi91",
                "comment_body": "because apple does not see a great return on investment in having a smooth workflow that includes windows. its pretty much as simple as that. i wish it wasn't like that and we could have deeper integration with iphone and windows.",
                "comment_author": "koala_csgo",
                "comment_dateTime": "2024-06-12 20:10:55",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8b14nj",
                        "comment_body": "Apple stopped bundling adapters starting with the iPhone 12. And they didn’t pass on the savings to consumers; iPhone prices are higher than ever. \n\nIf we could do everything wirelessly, from charging to data backup, they could skip the lightning-USB cable too, saving even more manufacturing costs.",
                        "comment_author": "MarkusEF",
                        "comment_dateTime": "2024-06-12 20:19:46",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Anyone know how to leave group chat?",
        "post_score": 9,
        "post_id": "1decetn",
        "post_url": "https://i.redd.it/rcsr0wi3f66d1.jpeg",
        "post_numComments": 10,
        "post_dateTime": "2024-06-12 19:32:48",
        "post_text": "I’m trying to leave this group chat and it’s pretty annoying that I can’t. I’ve tried to leave the convo but it’s grayed. Please help.",
        "post_comments": [
            {
                "comment_id": "l8atwjn",
                "comment_body": "Press the chat icon in the top middle and scroll down then press leave conversation",
                "comment_author": "Accomplished-Cut-264",
                "comment_dateTime": "2024-06-12 19:40:30",
                "comment_score": 9,
                "replies": [
                    {
                        "comment_id": "l8au3ab",
                        "comment_body": "You might not be able to leave with just 2 people try holding the thing to delete it from messages",
                        "comment_author": "Accomplished-Cut-264",
                        "comment_dateTime": "2024-06-12 19:41:31",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8cqefm",
                                "comment_body": "Add a random person and leave, it’s their problem now. 😂",
                                "comment_author": "iAdden",
                                "comment_dateTime": "2024-06-13 02:22:30",
                                "comment_score": 6,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8b35e5",
                "comment_body": "It should be directly below the “Hide Alerts” bar. However if it’s SMS you can only “delete and block conversation”. If it’s iMessage, you can just leave it.",
                "comment_author": "kygei",
                "comment_dateTime": "2024-06-12 20:30:46",
                "comment_score": 3,
                "replies": [
                    {
                        "comment_id": "l8bhljl",
                        "comment_body": "Goddamn android people, 🤣",
                        "comment_author": "richempire",
                        "comment_dateTime": "2024-06-12 21:50:13",
                        "comment_score": -2,
                        "replies": [
                            {
                                "comment_id": "l8biigm",
                                "comment_body": "Hopefully RCS fixes that too.",
                                "comment_author": "EliteAgent51",
                                "comment_dateTime": "2024-06-12 21:55:12",
                                "comment_score": 4,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8bml1a",
                "comment_body": "There’s not enough people in the group chat to leave. If you leave it’ll just be a one on one with the people in there. What I do is just sacrifice one of my other friends and leave.",
                "comment_author": "landonb0909",
                "comment_dateTime": "2024-06-12 22:17:36",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8bogev",
                "comment_body": "If a group chat is 3 people then you can’t leave. You have to add a 4th person and then it will let you leave. \n\nIf this group chat has an android, you can’t leave at all no matter what.",
                "comment_author": "StillChillBuster",
                "comment_dateTime": "2024-06-12 22:27:58",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8bt6qu",
                "comment_body": "I finally was able to leave a particular group chat with the latest update, 17.0 .4?   \nclick on the top of the chat, and then at the bottom it will say leave delete this conversation.",
                "comment_author": "kimwim43",
                "comment_dateTime": "2024-06-12 22:54:08",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Old phone I'm locked out of",
        "post_score": 0,
        "post_id": "1debtm9",
        "post_url": "https://www.reddit.com/r/iphone/comments/1debtm9/old_phone_im_locked_out_of/",
        "post_numComments": 11,
        "post_dateTime": "2024-06-12 19:08:08",
        "post_text": "Is there literally ANY WAY I can get into this phone without losing the pics. I use Droid so iphones aren't my strong suit",
        "post_comments": [
            {
                "comment_id": "l8apy9z",
                "comment_body": "Return it to the person that owns it. They can log in with their passcode to access their data.",
                "comment_author": "James_Atlanta",
                "comment_dateTime": "2024-06-12 19:19:02",
                "comment_score": 5,
                "replies": [
                    {
                        "comment_id": "l8au0px",
                        "comment_body": "It's literally mine. I'm not a scumbag. I got fucked up ( I'm clean now) n forgot the PW",
                        "comment_author": "Cr1ms0nManat33",
                        "comment_dateTime": "2024-06-12 19:41:07",
                        "comment_score": -3,
                        "replies": [
                            {
                                "comment_id": "l8av4k8",
                                "comment_body": "If it was ever synced with iCloud, the pictures would be in iCloud. \n\nDo you know your iCloud credentials?\n\nWithout the passcode or the Apple ID credentials, the phone is a paperweight.",
                                "comment_author": "James_Atlanta",
                                "comment_dateTime": "2024-06-12 19:47:09",
                                "comment_score": 2,
                                "replies": [
                                    {
                                        "comment_id": "l8bl8hg",
                                        "comment_body": "I may actually no that info. Iv been just yelling at the phone. I'll try. Thank you\n\nEdit for shit spelling",
                                        "comment_author": "Cr1ms0nManat33",
                                        "comment_dateTime": "2024-06-12 22:10:13",
                                        "comment_score": 1,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "l8aumq4",
                        "comment_body": "It's got old pictures of my friend who just ODd on the phone.  It's sentimental shit.",
                        "comment_author": "Cr1ms0nManat33",
                        "comment_dateTime": "2024-06-12 19:44:29",
                        "comment_score": -3,
                        "replies": [
                            {
                                "comment_id": "l8azswk",
                                "comment_body": "It is impossible to access the data without the password or iCloud login if applicable. \n\nIf you know your iCloud login and it was logged into iCloud, you can access the data from there. \n\nAfter that, if you don't care about anything on the phone that wasn't backed up, you can factory reset it without the password, you'll need the iCloud login though because it will phone home and have an activation lock during the setup process.",
                                "comment_author": "CreamOdd7966",
                                "comment_dateTime": "2024-06-12 20:12:33",
                                "comment_score": 2,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8arwxo",
                "comment_body": "The FBI complained multiple times about unlocking criminals’ iPhones being impossible.\nWhat do you think?",
                "comment_author": "AltAccount231123",
                "comment_dateTime": "2024-06-12 19:29:34",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8au3wb",
                        "comment_body": "I'm a criminal, yes. But the phone is mine. I don't steal shit.",
                        "comment_author": "Cr1ms0nManat33",
                        "comment_dateTime": "2024-06-12 19:41:36",
                        "comment_score": -1,
                        "replies": [
                            {
                                "comment_id": "l8b19q8",
                                "comment_body": "I didn’t say it’s not yours, but my point still stands.You can’t just unlock it",
                                "comment_author": "AltAccount231123",
                                "comment_dateTime": "2024-06-12 20:20:32",
                                "comment_score": 2,
                                "replies": [
                                    {
                                        "comment_id": "l8bl1sv",
                                        "comment_body": "Ur right, my bad. So I'm fooked.. thanks for ur Input dude",
                                        "comment_author": "Cr1ms0nManat33",
                                        "comment_dateTime": "2024-06-12 22:09:11",
                                        "comment_score": 2,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8aua91",
                "comment_body": "It was just a question.",
                "comment_author": "Cr1ms0nManat33",
                "comment_dateTime": "2024-06-12 19:42:34",
                "comment_score": -1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "How do you pause and then continue recording a voice memo without it starting a new recording? ",
        "post_score": 5,
        "post_id": "1debrw5",
        "post_url": "https://www.reddit.com/r/iphone/comments/1debrw5/how_do_you_pause_and_then_continue_recording_a/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 19:06:07",
        "post_text": "I can’t see any option to pause, just the stop button when in ends the recording. ",
        "post_comments": [
            {
                "comment_id": "l8apmik",
                "comment_body": "Once the recording is running, press anywhere BUT the red stop button in the recording area. Bottom half of the screen. \n\nThis will change the screen and show a pause button and other editing options.",
                "comment_author": "WalkThat",
                "comment_dateTime": "2024-06-12 19:17:15",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8camql",
                        "comment_body": "TIL: you could pause, voice memos, thank you",
                        "comment_author": "Tesla2007",
                        "comment_dateTime": "2024-06-13 00:39:07",
                        "comment_score": 3,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "How to get rid of this notification?",
        "post_score": 5,
        "post_id": "1debol7",
        "post_url": "https://i.redd.it/184ixyun966d1.jpeg",
        "post_numComments": 5,
        "post_dateTime": "2024-06-12 19:02:20",
        "post_text": "The app is closed and I got off the train two hours ago, I have turned my phone on and off but still nothing. This little notification will not go away. ",
        "post_comments": [
            {
                "comment_id": "l8bl5ew",
                "comment_body": "There are a couple of ways I know of.\n\nFirst, check the Notification Center and if the Live Activity is there, swipe it away like you would a normal notification.\n\nOr, you can just swipe either left or right in the Dynamic Island itself to hide it.",
                "comment_author": "StellarAelwyd",
                "comment_dateTime": "2024-06-12 22:09:45",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8anyzx",
                "comment_body": "Click the island then close it or it’s probably a setting in the app",
                "comment_author": "Accomplished-Cut-264",
                "comment_dateTime": "2024-06-12 19:08:12",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ao9dc",
                "comment_body": "Remove this app or trying clearing cache or force shutdown app",
                "comment_author": "Sunnykuku",
                "comment_dateTime": "2024-06-12 19:09:46",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ckd26",
                "comment_body": "Emigrate to Japan lol",
                "comment_author": "LambbbSauce",
                "comment_dateTime": "2024-06-13 01:42:02",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Issue with mobile data(slow)",
        "post_score": 4,
        "post_id": "1debjd2",
        "post_url": "https://www.reddit.com/r/iphone/comments/1debjd2/issue_with_mobile_dataslow/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 18:56:23",
        "post_text": "Hello everyone, I am on an iPhone 15 pro and my mobile data is really, I use 5G, but when watching videos or playing an online game it lags, anyone has any idea how to fix this issue? Thank you in advance!",
        "post_comments": [
            {
                "comment_id": "l8jyjaq",
                "comment_body": "Talk to your carrier.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 10:59:31",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Unlock Question",
        "post_score": 1,
        "post_id": "1debhoh",
        "post_url": "https://www.reddit.com/r/iphone/comments/1debhoh/unlock_question/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-12 18:54:28",
        "post_text": "So I recently went to a fundraising sale for a community. Kind of like a garage sale but every item was name your price and the money went to raising a dog park. I found a rose colored iPhone 7 on the desk and asked if this was supposed to be there. The ladies stated it was donated and one of the older ladies old phones and I could take it for a donation. I donated my cash for the phone and other items and when I got home (3 days later) I saw the phone was still logged in as it's former user. It was a lady at the sale who helped run its old phone. This was discovered a few days after the sale and when I tried to factory reset the iCloud password was needed. I've read you can download iTunes and reset but you still need the password. There's also a trick with find my iPhone and that didn't work.\n\n  \nI tried contacting the ladies new cell which I assumed was the same as the old number and got nothing. I found an address in her contacts and me and my girlfriend rode our bicycles there (she lived 15 minutes away from us) and she wasn't home. And I texted her seeing if she A. Wants her phone back since it is not unlocked anyways or B. could input the password for the cloud so we can factory reset and use.\n\n  \nAnyone know how I can factory reset this? It's the Rose iPhone 7 like I stated and I just want to factory reset to stock. If not I was thinking about just dropping it off in one of those donate my phone machines at the mall. Not sure how that works though! \n\n  \nThanks in advance!",
        "post_comments": [
            {
                "comment_id": "l8amahg",
                "comment_body": "You can’t use it if it’s still locked to her code. No way around it",
                "comment_author": "NYChockey14",
                "comment_dateTime": "2024-06-12 18:58:51",
                "comment_score": 4,
                "replies": [
                    {
                        "comment_id": "l8an4md",
                        "comment_body": "Makes sense. That's what I am finding out, also. Thank you.",
                        "comment_author": "External_Study_9614",
                        "comment_dateTime": "2024-06-12 19:03:31",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8ao76z",
                "comment_body": "You're going to have to physically have her remove it from her iCloud account. I would swing by her house later to see if she's available. (then again, she might not take kindly to \"Hi, I'm using your cellphone, could you de-activate it please?\")",
                "comment_author": "tlonreddit",
                "comment_dateTime": "2024-06-12 19:09:26",
                "comment_score": 4,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Data only secondary SIM turn off text messaging",
        "post_score": 4,
        "post_id": "1debder",
        "post_url": "https://www.reddit.com/r/iphone/comments/1debder/data_only_secondary_sim_turn_off_text_messaging/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 18:49:32",
        "post_text": "I got a secondary SIM with Data only plan, that I can use as fallback when primary data is not available.  However, I am getting text messages to the secondary number.  How do I turn text messaging off, but leave the data active?",
        "post_comments": [
            {
                "comment_id": "l8ddzi7",
                "comment_body": "Receiving text messages on your data only line is a carrier level feature/configuration.\n\nI’d suggest unticking the number for that data line under iMessages and FaceTime in Settings and contact your carrier. \n\nI have a data only line for my phone and mobile broadband router, and I do get occasional text messages sent to it. As it is still a mobile service/number, my carrier tells me it is normal.",
                "comment_author": "cell_dch_4363",
                "comment_dateTime": "2024-06-13 05:01:19",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8denca",
                        "comment_body": "Ok thanks. That is helpful.",
                        "comment_author": "Evening_Dot_1292",
                        "comment_dateTime": "2024-06-13 05:05:55",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Apple Care in Europe",
        "post_score": 4,
        "post_id": "1deb6bs",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deb6bs/apple_care_in_europe/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-12 18:41:19",
        "post_text": "Hi all,\n\nI was pickpocketed in Italy while on vacation. I need to replace my phone, but I'm going to Greece tomorrow and to Amsterdam after. I have Apple Care Theft & Loss, which I was surprised to find will ship my replacement device to Europe, but they don't ship to Greece. Any advice? I believe that I currently have one option, which is to ship it to my hotel in Amsterdam, because I can't just go to an Apple store and get a new one before I leave for Greece, right? I have to have them shipped because they're refurbished or something? It's really unfortunate that I have to have my friends plan all of our travel arrangements for the entirety of Greece.\n\nThanks,  \n-Dylan",
        "post_comments": [
            {
                "comment_id": "l8awbi0",
                "comment_body": "Where in Italy, if I may ask?",
                "comment_author": "TiredOfStudies",
                "comment_dateTime": "2024-06-12 19:53:38",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8awuyd",
                        "comment_body": "This happened in Rome, but I'm in Naples now.",
                        "comment_author": "dylandalal",
                        "comment_dateTime": "2024-06-12 19:56:32",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8c2p6o",
                "comment_body": "Apple europe does not sell nor keep stock of US model iPhones, hence them having to ship it to somewhere, so yeah they have to get it mailed.\n\nNow why Greece isn’t an option I have no idea, I’m willing to bet that they probably don’t have official presence there most likely.",
                "comment_author": "traumalt",
                "comment_dateTime": "2024-06-12 23:49:24",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "What is this TY that my phone and  iPad are connected to and I can’t remove it ?",
        "post_score": 220,
        "post_id": "1deaw5s",
        "post_url": "https://i.redd.it/g7dmbn4r366d1.jpeg",
        "post_numComments": 28,
        "post_dateTime": "2024-06-12 18:29:14",
        "post_text": "",
        "post_comments": [
            {
                "comment_id": "l8aicni",
                "comment_body": "Google says that some devices remove the “i” when connected (fitbits, tesla car, etc). The way to fix it is to to your Privacy & Security setting, go down to Bluetooth, and start removing things one by one until you find the culprit",
                "comment_author": "NYChockey14",
                "comment_dateTime": "2024-06-12 18:37:22",
                "comment_score": 205,
                "replies": [
                    {
                        "comment_id": "l8ajc5c",
                        "comment_body": ":( they gotta make me do the extra work   But thanks so much this is useful",
                        "comment_author": "Mysterious_Speed8865",
                        "comment_dateTime": "2024-06-12 18:42:46",
                        "comment_score": 89,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8ap0as",
                "comment_body": "TY is a Tuya device. Do you have a random Chinese Bluetooth speaker or something?",
                "comment_author": "schaudhery",
                "comment_dateTime": "2024-06-12 19:13:52",
                "comment_score": 108,
                "replies": [
                    {
                        "comment_id": "l8ap6eo",
                        "comment_body": "Nope I don’t think so ? Is there someone spying on me or something ?",
                        "comment_author": "Mysterious_Speed8865",
                        "comment_dateTime": "2024-06-12 19:14:48",
                        "comment_score": 28,
                        "replies": [
                            {
                                "comment_id": "l8apf26",
                                "comment_body": "No, this thread might help: https://discussions.apple.com/thread/253281617",
                                "comment_author": "schaudhery",
                                "comment_dateTime": "2024-06-12 19:16:07",
                                "comment_score": 61,
                                "replies": [
                                    {
                                        "comment_id": "l8apu07",
                                        "comment_body": "Oh smart life it cold be that but the app barely works tbh \n\n\nThis one just answered my question thank you so so so much",
                                        "comment_author": "Mysterious_Speed8865",
                                        "comment_dateTime": "2024-06-12 19:18:23",
                                        "comment_score": 104,
                                        "replies": [
                                            {
                                                "comment_id": "l8bqtak",
                                                "comment_body": "Miau 🐈‍⬛",
                                                "comment_author": "stabledisastermaster",
                                                "comment_dateTime": "2024-06-12 22:41:01",
                                                "comment_score": 37,
                                                "replies": []
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8aiewj",
                "comment_body": "Crackhead and choo-choo now that’s what I call a name",
                "comment_author": "Accomplished-Cut-264",
                "comment_dateTime": "2024-06-12 18:37:42",
                "comment_score": 244,
                "replies": [
                    {
                        "comment_id": "l8aiw3l",
                        "comment_body": "Sadly crack head one was lost during a flight \nNow I can still see it on the map somewhere around Italy \nI didn’t disable it I let them have it coz 😭",
                        "comment_author": "Mysterious_Speed8865",
                        "comment_dateTime": "2024-06-12 18:40:19",
                        "comment_score": 97,
                        "replies": [
                            {
                                "comment_id": "l8aj835",
                                "comment_body": "The big peepee poopoo😂😂😂",
                                "comment_author": "Accomplished-Cut-264",
                                "comment_dateTime": "2024-06-12 18:42:09",
                                "comment_score": 38,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8b3zxx",
                "comment_body": "Baking Bread is a great BT device name",
                "comment_author": "locololus",
                "comment_dateTime": "2024-06-12 20:35:24",
                "comment_score": 43,
                "replies": [
                    {
                        "comment_id": "l8bb755",
                        "comment_body": "I was just gonna say, who makes a “smart” bread maker and how much was it? Lol",
                        "comment_author": "Extinction-Entity",
                        "comment_dateTime": "2024-06-12 21:14:57",
                        "comment_score": 15,
                        "replies": []
                    },
                    {
                        "comment_id": "l8br2su",
                        "comment_body": "Lmao that’s my brothers speaker  it was a funny way of saying breaking bad",
                        "comment_author": "Mysterious_Speed8865",
                        "comment_dateTime": "2024-06-12 22:42:29",
                        "comment_score": 14,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8c0gbx",
                "comment_body": "Crackhead got me 💀",
                "comment_author": "k0al",
                "comment_dateTime": "2024-06-12 23:36:07",
                "comment_score": 13,
                "replies": []
            },
            {
                "comment_id": "l8e4uvn",
                "comment_body": "I’m more concerned about being connected to the crackhead Than the TY",
                "comment_author": "Hot-Quality8768",
                "comment_dateTime": "2024-06-13 09:11:06",
                "comment_score": 10,
                "replies": []
            },
            {
                "comment_id": "l8cp5vv",
                "comment_body": "It's a new bluetooth Beanie Baby",
                "comment_author": "graysky311",
                "comment_dateTime": "2024-06-13 02:14:10",
                "comment_score": 9,
                "replies": []
            },
            {
                "comment_id": "l8c0jh5",
                "comment_body": "Ask choo choo and crackhead",
                "comment_author": "CelticBlue22",
                "comment_dateTime": "2024-06-12 23:36:38",
                "comment_score": 15,
                "replies": []
            },
            {
                "comment_id": "l8c2paq",
                "comment_body": "It’s gonna be a device that’s been added via an app I beleive. My car key is listed in a similar way with no “i” next to it as it’s managed via that manufacturers app.",
                "comment_author": "fl00r3y",
                "comment_dateTime": "2024-06-12 23:49:25",
                "comment_score": 8,
                "replies": []
            },
            {
                "comment_id": "l8cb4j1",
                "comment_body": "Do you have an automatic cat feeder by any chance?",
                "comment_author": "No_Page9413",
                "comment_dateTime": "2024-06-13 00:42:15",
                "comment_score": 5,
                "replies": []
            },
            {
                "comment_id": "l8ble7r",
                "comment_body": "I have a Toshiba bluetooth stereo that appears as TY with some numbers after it.",
                "comment_author": "Oxigenic",
                "comment_dateTime": "2024-06-12 22:11:05",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8dknhn",
                "comment_body": "Do you have any HomeKit devices?\nI've seen Bluetooth accessories appear as connected sometimes.",
                "comment_author": "iklier",
                "comment_dateTime": "2024-06-13 05:51:54",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8eb04c",
                "comment_body": "TubeYou",
                "comment_author": "MrLuBurt",
                "comment_dateTime": "2024-06-13 10:24:53",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ju0da",
                "comment_body": "The big peepee poopoo is a commendable name for device",
                "comment_author": "reaperwasnottaken",
                "comment_dateTime": "2024-06-14 10:05:07",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8kexvu",
                "comment_body": "Thank You",
                "comment_author": "SoftCircleImage",
                "comment_dateTime": "2024-06-14 13:48:05",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8gfy2l",
                "comment_body": "Do you have light or something you use over tuya app ?",
                "comment_author": "Madzorki",
                "comment_dateTime": "2024-06-13 19:38:03",
                "comment_score": 0,
                "replies": []
            },
            {
                "comment_id": "l8gv75w",
                "comment_body": "Shot in the dark, but is it the name of the phone that the iPad is tethered to?",
                "comment_author": "Professional-Ebb-434",
                "comment_dateTime": "2024-06-13 21:03:39",
                "comment_score": 0,
                "replies": []
            },
            {
                "comment_id": "l8e9z11",
                "comment_body": "I said who psy is this she say dolla sign",
                "comment_author": "Matei_Agape",
                "comment_dateTime": "2024-06-13 10:12:21",
                "comment_score": -1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Does anyone know why my phone started recording unexpectedly?",
        "post_score": 1,
        "post_id": "1deatpm",
        "post_url": "https://i.redd.it/ge0t3849366d1.jpeg",
        "post_numComments": 4,
        "post_dateTime": "2024-06-12 18:26:24",
        "post_text": "The other night, the red dot turned on on its own. It didn’t look exactly like the one in the photo, it was the red dot with a border of small dashes. I quit every app on my phone and triple checked I didn’t accidentally start screen recording. Is this a sign of malware on my iPhone?",
        "post_comments": [
            {
                "comment_id": "l8ayrhk",
                "comment_body": "could be. is your iOS up to date?",
                "comment_author": "AZjackgrows",
                "comment_dateTime": "2024-06-12 20:06:51",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8az2nn",
                        "comment_body": "Yes, I am on iOS 17.5.1.",
                        "comment_author": "desidumbass",
                        "comment_dateTime": "2024-06-12 20:08:34",
                        "comment_score": 2,
                        "replies": [
                            {
                                "comment_id": "l8azoc2",
                                "comment_body": "Try a hard reset and see if it happens again. If it does, may be worth backing up and resetting the phone to factory.",
                                "comment_author": "AZjackgrows",
                                "comment_dateTime": "2024-06-12 20:11:50",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8c3200",
                "comment_body": "It’s just a 3 letter agency working in the background lol.",
                "comment_author": "No_Drummer_2937",
                "comment_dateTime": "2024-06-12 23:51:33",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Iphone updates",
        "post_score": 0,
        "post_id": "1deaktj",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deaktj/iphone_updates/",
        "post_numComments": 8,
        "post_dateTime": "2024-06-12 18:16:13",
        "post_text": "One thing i dislike about iphones is how long it takes to simply update the darn phone. Like why??? ",
        "post_comments": [
            {
                "comment_id": "l8am7he",
                "comment_body": "Weil, let it do this at night.",
                "comment_author": "Arkhamryder",
                "comment_dateTime": "2024-06-12 18:58:24",
                "comment_score": 5,
                "replies": [
                    {
                        "comment_id": "l8auqah",
                        "comment_body": "I just got the phone and night time is hours away..",
                        "comment_author": "Gammataichi",
                        "comment_dateTime": "2024-06-12 19:45:01",
                        "comment_score": -3,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8aj8hj",
                "comment_body": "Because...",
                "comment_author": "Thewinedup",
                "comment_dateTime": "2024-06-12 18:42:12",
                "comment_score": 4,
                "replies": [
                    {
                        "comment_id": "l8aulhm",
                        "comment_body": "Because Apple",
                        "comment_author": "Gammataichi",
                        "comment_dateTime": "2024-06-12 19:44:17",
                        "comment_score": -6,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8auvc6",
                "comment_body": "cool",
                "comment_author": "drummwill",
                "comment_dateTime": "2024-06-12 19:45:46",
                "comment_score": 3,
                "replies": []
            },
            {
                "comment_id": "l8ai5r5",
                "comment_body": "Oh.",
                "comment_author": "Impossible-Hawk768",
                "comment_dateTime": "2024-06-12 18:36:18",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8aurl0",
                        "comment_body": "Oh indeed.",
                        "comment_author": "Gammataichi",
                        "comment_dateTime": "2024-06-12 19:45:13",
                        "comment_score": 0,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8avuuc",
                "comment_body": "Quick update: lesson learned, don't transfer data during setup. I did that and was met with an unskipable update to ios 17 5.1 message. I started over, got into the phone (and some of my data is already transferred, but I'll do the full transfer later) then i updated the phone which took wayyyyyyyyyyyyy less time.",
                "comment_author": "Gammataichi",
                "comment_dateTime": "2024-06-12 19:51:07",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Iphone 12 sluggish when low on RAM. Help!",
        "post_score": 1,
        "post_id": "1deadv2",
        "post_url": "https://www.reddit.com/r/iphone/comments/1deadv2/iphone_12_sluggish_when_low_on_ram_help/",
        "post_numComments": 17,
        "post_dateTime": "2024-06-12 18:08:05",
        "post_text": "I'm encountering slow performance on my iPhone 12, especially when I'm low on RAM. I've already attempted a few troubleshooting steps to reduce RAM usage, but it hasn't made much of a difference. Here's what I've done so far: \n\n* 1. Updated my iPhone to the latest version of iOS. \n* 2. Disabled Background App Refresh. \n* 3. Kept only my two most important widgets. \n* 4. Minimized the number of open apps. \n* 5. Restarted my phone. \n* 6. Cleared the browser cache. \n* 7. Ensured I have about 15 to 20% of my storage empty. \n* 8. Disabled auto-downloads. \n* 9. Turned off transparency and motion effects. \n\nDespite these efforts, my phone still feels sluggish. Has anyone else encountered this issue or have any additional tips to free up RAM and improve performance?\n\nThank you for your help!",
        "post_comments": [
            {
                "comment_id": "l8aj4jk",
                "comment_body": "How much free space do you have?",
                "comment_author": "h8deluxe_dva",
                "comment_dateTime": "2024-06-12 18:41:38",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8ajmry",
                        "comment_body": "14 GB of free space out of 64 GB.",
                        "comment_author": "Ki-Moon780",
                        "comment_dateTime": "2024-06-12 18:44:21",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8bhswc",
                "comment_body": "I have the same problem. When I close the resource intensive app its gets fluid again. I still have 150gb plus free space and 85% battery.\n\nAdditionally, when battery gets red, the sound speaker suddenly gets very quiet.  This happened to my 12mini as well as 12.",
                "comment_author": "No-Job-4431",
                "comment_dateTime": "2024-06-12 21:51:21",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8b8lw9",
                "comment_body": "How do you know it’s low on RAM? Try a factory reset and maybe a battery replacement",
                "comment_author": "axellie",
                "comment_dateTime": "2024-06-12 21:00:32",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8ctnrq",
                        "comment_body": "I have an app that shows my RAM usage and also if I have no widget and no apps open it snappy again.",
                        "comment_author": "Ki-Moon780",
                        "comment_dateTime": "2024-06-13 02:44:14",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8da2d0",
                                "comment_body": "IMO I wouldn’t pay too much attention to the RAM usage. iOS keeps as much stuff loaded into RAM as possible to prevent having to reboot apps as much as possible and dynamically removes the oldest items when a foreground app needs more RAM. My SE3 currently has 120MB free and it remains very snappy. \n\nYou may want to attempt a factory reset in case some core part of the OS has become bugged out.",
                                "comment_author": "nooneinpar7",
                                "comment_dateTime": "2024-06-13 04:34:26",
                                "comment_score": 3,
                                "replies": [
                                    {
                                        "comment_id": "l8ewexo",
                                        "comment_body": "I was planning on doing just that this evening. ☺️",
                                        "comment_author": "Ki-Moon780",
                                        "comment_dateTime": "2024-06-13 14:03:04",
                                        "comment_score": 1,
                                        "replies": []
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "comment_id": "l8ctsu3",
                        "comment_body": "Battery replacement at 85%?",
                        "comment_author": "Ki-Moon780",
                        "comment_dateTime": "2024-06-13 02:45:10",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8dv1ld",
                                "comment_body": "Try a factory reset first",
                                "comment_author": "axellie",
                                "comment_dateTime": "2024-06-13 07:25:37",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8agr2c",
                "comment_body": "Unfortunately the iPhone 12 is old and doesn’t really have enough ram to support all the lastest features of iOS. There’s not a whole lot you can do apart from replacing the battery if its health is low. That’ll give you a boost. (But ONLY if your battery health is low)\n\nIf you think it’s bad now, just wait until iOS 18 comes out. 😬😬",
                "comment_author": "Veriliann",
                "comment_dateTime": "2024-06-12 18:28:29",
                "comment_score": -1,
                "replies": [
                    {
                        "comment_id": "l8ahux3",
                        "comment_body": "My battery is currently at 85%. It is annoying, especially considering I upgraded from an iPhone 6s that never felt as slow as this iPhone 12.",
                        "comment_author": "Ki-Moon780",
                        "comment_dateTime": "2024-06-12 18:34:38",
                        "comment_score": 1,
                        "replies": []
                    },
                    {
                        "comment_id": "l8d1mvn",
                        "comment_body": "Should have got the Pro Max or a Samsung",
                        "comment_author": "Ki-Moon780",
                        "comment_dateTime": "2024-06-13 03:37:51",
                        "comment_score": 1,
                        "replies": []
                    },
                    {
                        "comment_id": "l8am7a3",
                        "comment_body": "Then why Apple support they old devices",
                        "comment_author": "Professional-Bad4299",
                        "comment_dateTime": "2024-06-12 18:58:22",
                        "comment_score": 0,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "help w/ inbound calls (Verizon)",
        "post_score": 3,
        "post_id": "1dea4my",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dea4my/help_w_inbound_calls_verizon/",
        "post_numComments": 3,
        "post_dateTime": "2024-06-12 17:57:41",
        "post_text": "Hiya there! I’m hoping someone can help me 😅 \n\nMy partner has a 11Pro Max iPhone that hasn’t been getting inbound calls. He can make calls, text, do anything else.. just anytime anyone calls him, it shows on his phone for a second and then the caller hears “the number you’ve dialed is out of service, or has been disconnected”. I’ve put in a service request with Verizon but they’ve been of no help. \n\nThe phone is current on updates, works perfectly besides what’s mentioned above. I’ve read online this is a known issue with Verizon. Has anyone had this problem and fixed it? Really don’t want to get a new phone if it’s not 1000% needed. \n",
        "post_comments": [
            {
                "comment_id": "l8jz8ze",
                "comment_body": "U got ur answer already. Its a Verizon issue.",
                "comment_author": "tlasan1",
                "comment_dateTime": "2024-06-14 11:08:09",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8kocfn",
                        "comment_body": "Thank you. I was looking for solutions to the issue. 🙄",
                        "comment_author": "splicey_",
                        "comment_dateTime": "2024-06-14 14:59:09",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Iphone15 Pro and IG",
        "post_score": 0,
        "post_id": "1dea0ev",
        "post_url": "https://www.reddit.com/r/iphone/comments/1dea0ev/iphone15_pro_and_ig/",
        "post_numComments": 1,
        "post_dateTime": "2024-06-12 17:52:43",
        "post_text": "Hi there! I have a 15pro and every time I upload to IG, the photo is over saturated or poor quality, or both. Same with my Stories.\n\nAny advice? I’ve tried deleting the app, reinstalling, etc. ",
        "post_comments": [
            {
                "comment_id": "l8aw6l6",
                "comment_body": "https://preview.redd.it/4cxf2gzmi66d1.jpeg?width=1290&format=pjpg&auto=webp&s=65c7d12b20c53f7ba41c2b90a00fd319489caba7\n\nUse this setting in IG then you’re good to go.",
                "comment_author": "zfranks94",
                "comment_dateTime": "2024-06-12 19:52:53",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Is is possible to power off an iphone 11pro with a screen that doesn’t function?",
        "post_score": 3,
        "post_id": "1de9w89",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de9w89/is_is_possible_to_power_off_an_iphone_11pro_with/",
        "post_numComments": 5,
        "post_dateTime": "2024-06-12 17:47:43",
        "post_text": "My screen broke earlier today, its pressing by itself and i cant slide the thing to turn it off. It keeps typing the passcode by itself and im afraid it will be disabled for eternity so how do i power it off?",
        "post_comments": [
            {
                "comment_id": "l8abfil",
                "comment_body": "Volume up volume down hold power",
                "comment_author": "Professional_Ad_6463",
                "comment_dateTime": "2024-06-12 17:57:54",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8c7j5g",
                        "comment_body": "Doesnt that do a restart?",
                        "comment_author": "HamzehArab",
                        "comment_dateTime": "2024-06-13 00:19:16",
                        "comment_score": 0,
                        "replies": [
                            {
                                "comment_id": "l8c9n9a",
                                "comment_body": "Only if you hold it long enough for the Apple logo to appear",
                                "comment_author": "Professional_Ad_6463",
                                "comment_dateTime": "2024-06-13 00:32:44",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8c31xm",
                "comment_body": "You can ask Siri to do it",
                "comment_author": "zxch2412",
                "comment_dateTime": "2024-06-12 23:51:32",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8c7k5s",
                        "comment_body": "I have siri off",
                        "comment_author": "HamzehArab",
                        "comment_dateTime": "2024-06-13 00:19:26",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "How to set up phone so safe if it gets stolen when unlocked? ",
        "post_score": 2,
        "post_id": "1de9uqs",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de9uqs/how_to_set_up_phone_so_safe_if_it_gets_stolen/",
        "post_numComments": 17,
        "post_dateTime": "2024-06-12 17:46:01",
        "post_text": "A friend had her phone snatched out of her hand whilst on holiday. The phone was unlocked at the time and the thieves appear to have used her photos of herself saved on the device to access her phone face id and therefore all her apps and data. She's lost her gmail address which had all her photos in drive. Its terrifying. All my photos from every stage of my kids lives are saved in icloud and I'd be devistated if I lost them!  So I'm wondering how I should have my phone set up to ensure if it were ever stolen when unlocked the same couldn't happen to me? And how best to back up icloud photos to ensure I have my photos backed up? \n\nIs there any way to put a lock on photos to ensure nobody could access it if they stole your phone? ",
        "post_comments": [
            {
                "comment_id": "l8abylp",
                "comment_body": "That’s not possible to use a photo that’s saved as Face ID. Face ID is a 3D facial mapping system using laser dots. They used the already unlocked phone to access apps",
                "comment_author": "aquablaze69",
                "comment_dateTime": "2024-06-12 18:01:00",
                "comment_score": 11,
                "replies": [
                    {
                        "comment_id": "l8ac9f5",
                        "comment_body": "But they have accessed data that required Face ID or password to access. So even though her phone was unlocked they shouldn’t have been able to access this, and yet they have managed to. This seems to be the only possibility. They did not have her password or pin.",
                        "comment_author": "Rachel978",
                        "comment_dateTime": "2024-06-12 18:02:49",
                        "comment_score": -5,
                        "replies": [
                            {
                                "comment_id": "l8ad9bm",
                                "comment_body": "I suppose if she had her settings set to not require attention and maybe if she had a mask setting on too mayyyyyyybe they could've used a photo but I don't think so. \n\nBesides there's nothing really that requires Face ID once it's unlocked you can't even use Face ID to get into the Face ID settings you have to enter the pin so I just don't see it I think there might be more to her story\n\nedit: I suppose thieves that are snatching phones out of hands are probably well-versed in how to quickly disable security features because they do it so much. So I'm just thinking off the top of my head\n\nThey would have to keep it unlocked while they take it wherever they have to in order to brute force the pin. Which would mean like as they're driving on their motorcycle which is how I always them doing it, they would have to be continuously operating the phone so it doesn't lock or until they get away then once they get away they can change the settings so that it doesn't lock for five minutes or indefinitely. Then that gives him a little bit of time to set the phone down or go get more phones or whatever it is. Then they would have to use some sort of a device that would brute force the pin… I mean I don't see it\n\nsecond edit: you said all of her photos are in Drive so maybe if she's on android? That would change things a little bit bit but not much. \n\nI don't see why she would've lost access to her Gmail or her files in drive. I mean if they steal the phone they can't go change her google password unless they have it. and even if the thieves did for some reason decide to go into her Drive and delete her photos she should still be able to login and restore them. I mean they shouldn't be gone I think we think the thieves are only interested in the phone",
                                "comment_author": "bdiddylv",
                                "comment_dateTime": "2024-06-12 18:08:48",
                                "comment_score": 1,
                                "replies": [
                                    {
                                        "comment_id": "l8af53o",
                                        "comment_body": "She has lost access to her gmail - they have changed her password somehow, and google won't reset it as she no longer has access to it to reset it. So she's lost her photos saved in the gmail account. I guess she didn't have a recovery account set up. Foolish I know, but also entirely possible.",
                                        "comment_author": "Rachel978",
                                        "comment_dateTime": "2024-06-12 18:19:40",
                                        "comment_score": 0,
                                        "replies": [
                                            {
                                                "comment_id": "l8bnt4m",
                                                "comment_body": "Did she keep a list of her passwords on her phone?",
                                                "comment_author": "EnergyLantern",
                                                "comment_dateTime": "2024-06-12 22:24:23",
                                                "comment_score": 1,
                                                "replies": []
                                            },
                                            {
                                                "comment_id": "l8ag12a",
                                                "comment_body": "yeah it just hit me how they did it. They go to the Google login screen and they click forgot password and then it sends a text to that phone and then they do it that way.\n\nso that means you cannot use that device as a back up device for your major accounts. major accounts are iCloud, Google and password manager if you use a different service for that\n\nYou have to have a secondary device such as your husband's phone or Google voice number or something set to go somewhere else that's not on that phone \n\nSo once they have access to the phone it's very easy to click on forgot password for your bank because the bank is going to send that to that phone. \n\nSo now that I'm thinking about it the reason they reset her Google password is because they need to get into her Google account to log all the other devices off so that way she can't login and see where the phone is or whatever\n\nThat's the thing about passkeys, and having things stored and encrypted on our phone is that it's all super secure as long as we are the ones holding our phone. \n\nNow even cops are allowed to hold your phone up to your face if you're being arrested and unlock your phone and go through it. like it was ruled it was not an invasion of privacy. So now you have to go back to pin or password if you have reasons to worry about that scenario.",
                                                "comment_author": "bdiddylv",
                                                "comment_dateTime": "2024-06-12 18:24:34",
                                                "comment_score": -1,
                                                "replies": [
                                                    {
                                                        "comment_id": "l8fguy8",
                                                        "comment_body": "Lmao. App lock and stolen device protection pretty much fix all these issues.",
                                                        "comment_author": "aquablaze69",
                                                        "comment_dateTime": "2024-06-13 16:22:02",
                                                        "comment_score": 1,
                                                        "replies": [
                                                            {
                                                                "comment_id": "l8ok5b2",
                                                                "comment_body": "really? well fuck",
                                                                "comment_author": "bdiddylv",
                                                                "comment_dateTime": "2024-06-15 05:52:21",
                                                                "comment_score": 1,
                                                                "replies": [
                                                                    {
                                                                        "comment_id": "l8p2yp8",
                                                                        "comment_body": "Lol",
                                                                        "comment_author": "aquablaze69",
                                                                        "comment_dateTime": "2024-06-15 09:16:35",
                                                                        "comment_score": 1,
                                                                        "replies": []
                                                                    }
                                                                ]
                                                            }
                                                        ]
                                                    }
                                                ]
                                            }
                                        ]
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8afl39",
                "comment_body": "I'm going to focus on your actual question. You want to know what's the best way to back up your photos to ensure that you don't lose access if the phone is ever stolen while unlocked correct?\n\nNumber one. Install Google Photos. And set that to back up all your photos automatically. So now you're backing up your photos into iCloud as well as onto Google servers.\n\nThen install Google Drive and set that to back up your phone as well so now it's backing up the photos 3 times \n\nicloud\nGoogle photos as pictures and\nGoogle Drive as files \n\nDo not save your Google password in your password manager on your iPhone. In fact there's three or four passwords you should never save anywhere except in your head or write them down in a special way that you can read. I can explain that if you like\n\nI never save my google password to any password manager, \nI never save my iCloud password to any password manager \nI never save my home router administrator password to any password manager \nAnd I never save my master password for any password manager in any other password manager\n\nedit: that also means you cannot have that phone set to be the back up device if you ever lose access. Because all the thieves have to do is say reset my password go ahead and send it to the phone number on the account they'll get the text they'll change your password\n\nThat also means you can't use a key for your Google or iCloud. You have to always enter the password. You don't want anything on that phone being associated with restoring access to that phone",
                "comment_author": "bdiddylv",
                "comment_dateTime": "2024-06-12 18:22:07",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8agtcb",
                        "comment_body": "Thank you, that’s what I wanted to know. Any other settings I should check?",
                        "comment_author": "Rachel978",
                        "comment_dateTime": "2024-06-12 18:28:50",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8akstp",
                                "comment_body": "maybe set the screen timeout to something shorter. 30 seconds is pretty quick but that's kind of what you're looking for\n\n\"google one\" is a service that I use in it gives me the ability to back up my entire phone whether it's android or iPhone and it gives me more space as well and it also gives me some extra photos options. \n\nsomething else you might wanna do is sign up for a six dollar a month Microsoft 365 account and that'll give you 2 TB of data on OneDrive (and all the ms apps)  They have an option that will import pictures from your Google account so once everything's in your Google account then you can pack it up into your Microsoft account and now all your photos should be in three spots. I wouldn't rely on it to be backing everything up all the time but certainly to get all the previous years. moving fwd, just make sure to backup manually now and again\n\nI also use Google maps and I have it set to always allow Google maps to access my location at all times. \n\nGoogle maps creates a timeline of everywhere my phone is. And it's come in handy many times when I can't remember if I went to work someday or whatever \n\nbut I would imagine that the thieves will not think of disabling Google maps on an iphone. They would probably only think about the \"Find My\" app\n\nI'm sure they just turn off location services but that's not the point.",
                                "comment_author": "bdiddylv",
                                "comment_dateTime": "2024-06-12 18:50:44",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8ac4bx",
                "comment_body": "Enable stolen device protection is the tip I have for you. IOS 18 is also going to bring app locking, so that’s probably a good thing to use as well for key banking and gmail apps and stuff.",
                "comment_author": "aquablaze69",
                "comment_dateTime": "2024-06-12 18:01:58",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8as56o",
                "comment_body": "When iOS 18 is released later this year, you can set individual apps like mail, messages and photos to require Face ID to open so there’s that security option coming soon. \n\nMake sure you have a recovery option you can access without your phone. Be that a laptop, pc, spouse or child’s or even a trusted friends phone. \n\nDon’t use just one photo storage option if you have important photos you don’t want to loose. Save really important stuff to physical media like a USB drive (or two!) as well as in iCloud/Google photos",
                "comment_author": "Richje",
                "comment_dateTime": "2024-06-12 19:30:49",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8aggym",
                "comment_body": "So what I want to know is, what settings I need to check to ensure this couldn’t happen to me?",
                "comment_author": "Rachel978",
                "comment_dateTime": "2024-06-12 18:26:58",
                "comment_score": 0,
                "replies": []
            }
        ]
    },
    {
        "post_title": "I need help with my iPhone AirPods please ",
        "post_score": 0,
        "post_id": "1de9per",
        "post_url": "https://i.redd.it/xamwzchxu56d1.jpeg",
        "post_numComments": 5,
        "post_dateTime": "2024-06-12 17:39:45",
        "post_text": "My iPhone is giving me a tracking notification regarding my AirPods and I don’t understand why I’m getting the tracking notification. They are listed as an item in my “Find My” app and I can see their location. How do I pair them correctly so my iPhone knows they are truly my item?  Thank you! ",
        "post_comments": [
            {
                "comment_id": "l8aatcw",
                "comment_body": "Stolen AirPods. If they’re truly yours they’d be setup under your account with no issues",
                "comment_author": "Veriliann",
                "comment_dateTime": "2024-06-12 17:54:17",
                "comment_score": 6,
                "replies": [
                    {
                        "comment_id": "l8afu96",
                        "comment_body": "nah, mine do this too, i factory reset them at some point and they work normal except i get these find my notifications",
                        "comment_author": "Electronic_Part",
                        "comment_dateTime": "2024-06-12 18:23:31",
                        "comment_score": 3,
                        "replies": []
                    },
                    {
                        "comment_id": "l8aq4yr",
                        "comment_body": "Nope, same thing happens to me. AirPods Pro worked great for like 6 months, then all of a sudden started getting these notifications. It’s annoying af but I suspect it’ll be fixed in a future update.",
                        "comment_author": "cornfedpig",
                        "comment_dateTime": "2024-06-12 19:20:01",
                        "comment_score": 1,
                        "replies": []
                    },
                    {
                        "comment_id": "l8b5r5r",
                        "comment_body": "This is what concerns me. They show up like they are mine under my “Find my” app and I can see their location.  How can I determine if they are truly mine or if someone else owns them?",
                        "comment_author": "Finding-nothing",
                        "comment_dateTime": "2024-06-12 20:45:00",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Transferring iPhone Data Without Apple ID Password",
        "post_score": 1,
        "post_id": "1de16dy",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de16dy/transferring_iphone_data_without_apple_id_password/",
        "post_numComments": 0,
        "post_dateTime": "2024-06-12 09:52:48",
        "post_text": "Hey all, got a bit of a tricky one here. My father-in-law died in 2017, and after he died my mother-in-law started using his phone. She knew the PIN code, and put her SIM in the phone. However, she doesn't know the Apple ID password. Obviously, it's now way overdue for her to get a new device. Apple doesn't allow access to Apple accounts of the deceased without a court order, which isn't an option right now. What would be the best way to go about transferring data to her new iPhone? \n\nObviously, we'll have her sign in with her own Apple ID. We can manually AirDrop things like photos and copy over notes and such, and I don't believe there are many, if any, apps that she purchased on the device. The main one is messages (she does use iMessage) -- is she just kind of out of luck there? My thought is that she'll need to de-register her phone number to her late husband's Apple ID, and re-register to her own? Any advice would be very helpful!",
        "post_comments": []
    },
    {
        "post_title": "Does anyone else's 13 Mini (or other OLED models) have a slight green tint?",
        "post_score": 2,
        "post_id": "1de9dne",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de9dne/does_anyone_elses_13_mini_or_other_oled_models/",
        "post_numComments": 4,
        "post_dateTime": "2024-06-12 17:25:30",
        "post_text": "I upgraded from a 6S to a 13 Mini. It's great in most respects but the screen has always looked a little dim and dingy.  \n\nI researched online and people said to turn off the TrueTone as that lowers the color temperature. I did that and it still doesn't look right. Comparing it side-by-side with my old 6S, I can see the 13 has a slight green tint. I'm a flashlight collector so I know exactly what this looks like, as most modern LED lights have green tint. Looking at the gray/white Settings screen, the 13 is clearly greenish while the 6S is magenta-tinted in comparison. And looking at photos, whites look crisp and clean on the 6S while slightly dull and dirty on the 13.  \n\nThis is disappointing as I expected a big step up from going to a phone that's 7 models newer, and going to OLED which was supposed to be some miracle technology with better colors than LCD. I expected the new phone to be better in every way. My phone is out of warranty so I can't ask for a new screen or anything.  \n\nApparently there's an Accessibility feature that lets you tint the screen, but that doesn't work. It's too strong, it tints the screen way too far into magenta.  \n\nDoes anyone else have this problem? I looked at a relative's 13 Mini and it seems to have the same issue so I guess it's a flaw in the model. I would have expected better from Apple, or for people to notice and complain about it more. I would think they would have calibrated this somehow in software. It could possibly be done by the user if that Accessibility feature allowed finer adjustments.  \n\n(Or perhaps I just got really lucky with my 6S? I don't think so as I've never felt this way about a device's screen before with other devices.)",
        "post_comments": [
            {
                "comment_id": "l8avzqc",
                "comment_body": "Idk about green but my OLED devices are all noticeably warmer (more yellow) than their LCD counterparts. My iPhone 15 Pro with True Tone off looks like my iPhone SE with True Tone on. My Steam Deck OLED is the same compared to the LCD model it replaced. So to an extent this seems to be normal.\n\nThere's also OLED panel lottery and your display might vary due to both individual calibration and quirks of the display manufacturer. I read a post comparing LG and Samsung's OLED screens for the 15 Pro and the LG panels were tinted green while the Samsungs were yellow.",
                "comment_author": "Mahboishk",
                "comment_dateTime": "2024-06-12 19:51:52",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8awtop",
                        "comment_body": "It really looks green to me, there might be a color temp difference but I think it's mostly tint.  \n\nI would hope there would be some way Apple could quickly test screens in production and produce a calibration profile that they could load into the phone to correct for these issues. Or at least let the users adjust it.",
                        "comment_author": "redtert",
                        "comment_dateTime": "2024-06-12 19:56:20",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l8axnt9",
                "comment_body": "Various older OLED models of phones suffered from some green tint issues, you can look up other brands such as the Galaxy S20. It's part of the panel lottery, I was unlucky with my S20. I'm not sure if the green tint still happens, but I know there are other issues such as mura. If it bothers you too much, I'd recommend a newer model, because switching to another 13 may just provide similar results.",
                "comment_author": "Einsteien",
                "comment_dateTime": "2024-06-12 20:00:50",
                "comment_score": 2,
                "replies": [
                    {
                        "comment_id": "l8az5q3",
                        "comment_body": "Thanks for the info. I'm not gonna switch because this phone is still pretty new and because there are no newer mini iphones.",
                        "comment_author": "redtert",
                        "comment_dateTime": "2024-06-12 20:09:01",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            }
        ]
    },
    {
        "post_title": "iPhone update issue",
        "post_score": 2,
        "post_id": "1de8z13",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de8z13/iphone_update_issue/",
        "post_numComments": 4,
        "post_dateTime": "2024-06-12 17:08:29",
        "post_text": "Does everyone know how to fix this?\nWhen I try to update my iPhone 11 Pro Max to iOS 17.5.1 It’s stuck on “Update verification” and after 2-3 minutes it’s shows “Unable to verify update. iOS 17.5.1 temporarily unavailable. Try again later”. I did factory data reset and nothing happen. It’s ts a bit annoying tbh 😩",
        "post_comments": [
            {
                "comment_id": "l8a4nf9",
                "comment_body": "Make sure it’s not public beta and maybe do that hold volume and power button power off or give it some time",
                "comment_author": "Accomplished-Cut-264",
                "comment_dateTime": "2024-06-12 17:18:10",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l8bwnww",
                        "comment_body": "Try this. Nothing happen. Weird. Maybe I will try to update via iTunes or if there will be iOS 18, bug will disappear",
                        "comment_author": "OkProgrammer744",
                        "comment_dateTime": "2024-06-12 23:13:52",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l8c26be",
                                "comment_body": "Leave your phone on charge overnight and see if it fixes I had a similar problem and that fixed it if I remember",
                                "comment_author": "Accomplished-Cut-264",
                                "comment_dateTime": "2024-06-12 23:46:19",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            }
        ]
    },
    {
        "post_title": "Iphone 13 pro - what is this on the edge ?",
        "post_score": 2,
        "post_id": "1de8i2c",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de8i2c/iphone_13_pro_what_is_this_on_the_edge/",
        "post_numComments": 5,
        "post_dateTime": "2024-06-12 16:49:08",
        "post_text": "hello, some one have an idea ?\n\n  \nthanks\n\nhttps://preview.redd.it/wvvp5dsul56d1.jpg?width=1170&format=pjpg&auto=webp&s=e0ff423710f1bb2ed905ccacf903df17e0d2a7f6\n\n",
        "post_comments": [
            {
                "comment_id": "l8a9p5d",
                "comment_body": "mmWave antenna. You can find it only if the model supports mmWave, it means in some countries there is no mmWave network so no antenna hole(e.g 13P from Korea)",
                "comment_author": "jinwooleo",
                "comment_dateTime": "2024-06-12 17:47:15",
                "comment_score": 5,
                "replies": []
            },
            {
                "comment_id": "l8a071c",
                "comment_body": "mmWave antenna for US variants",
                "comment_author": "PefeWilliams",
                "comment_dateTime": "2024-06-12 16:52:37",
                "comment_score": 10,
                "replies": []
            },
            {
                "comment_id": "l8a0a14",
                "comment_body": "It's the 5G antenna",
                "comment_author": "britelitees",
                "comment_dateTime": "2024-06-12 16:53:06",
                "comment_score": 4,
                "replies": []
            },
            {
                "comment_id": "l8au0e9",
                "comment_body": "It's a break in the metal of the frame to allow the antenna underneath to work.",
                "comment_author": "AdTotal801",
                "comment_dateTime": "2024-06-12 19:41:04",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l8ayqim",
                "comment_body": "It’s a-bomb which will detonate if you think of switching phones",
                "comment_author": "Zforthem",
                "comment_dateTime": "2024-06-12 20:06:42",
                "comment_score": -2,
                "replies": []
            }
        ]
    },
    {
        "post_title": "I need help with the SIMcard configuration of my Iphone 13 Pro Max. ",
        "post_score": 2,
        "post_id": "1de76ky",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de76ky/i_need_help_with_the_simcard_configuration_of_my/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 15:52:20",
        "post_text": "I have an Iphone 13 Pro Max 128GB with a version of IOS 17.5.1 (21F90) \n\nI've tried basic settings that I find on the internet, but nothing works. When I enter the settings if the SIM menus appear but it doesn't let me use Data, in general, I don't seem to signal. \n\nhttps://preview.redd.it/5yfwlianb56d1.jpg?width=1284&format=pjpg&auto=webp&s=df81b58b64f5e9983b49c06fdecb5f3b40213904\n\nDoes anyone know what I can do? ",
        "post_comments": [
            {
                "comment_id": "l8nd7dq",
                "comment_body": "u/gyatlatinas, is that SIM Card new? replacement? or else?, what carrier/country are you located (provide those details).\n\nor\n\nyou can contact the SIM provider's customer support and troubleshoot with them the issue with your SIM card and go from there.\n\nNote:\n\nKeep in mind depending on the carrier, type of SIM Card (new, replacement, etc), then you may need to follow the cellular carrier process to make sure the card is properly activated (each carrier has it's own procedure and in some cases, depending on the carrier and/or country, you may even need to white list your device, before you can use a SIM Card).",
                "comment_author": "H2CO3HCO3",
                "comment_dateTime": "2024-06-15 00:28:32",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "iPhone 5s repair using Linux?",
        "post_score": 1,
        "post_id": "1de6ksp",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de6ksp/iphone_5s_repair_using_linux/",
        "post_numComments": 4,
        "post_dateTime": "2024-06-12 15:24:30",
        "post_text": "I found my old iPhone 5s and it doesn’t seem that it will turn on, is there anyway to repair this use my Linux? I do not have an Apple computer anymore so any help would be greatly appreciated",
        "post_comments": [
            {
                "comment_id": "l89s9nq",
                "comment_body": "No.",
                "comment_author": "gcerullo",
                "comment_dateTime": "2024-06-12 16:06:06",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l89sx3q",
                        "comment_body": "Is there a way to fix it without the Apple ID of the phone? I might be able to use my mates",
                        "comment_author": "JO_P_SI",
                        "comment_dateTime": "2024-06-12 16:10:03",
                        "comment_score": 1,
                        "replies": [
                            {
                                "comment_id": "l89vj8s",
                                "comment_body": "If you are able to erase it and reinstall iOS you will still need the Apple ID and password to set it up otherwise it will remain activation locked. There is no way to remove the activation lock without knowing the Apple ID and password.\n\nIf you need to recover the Apple ID and/or password.\n\nhttps://support.apple.com/102656",
                                "comment_author": "gcerullo",
                                "comment_dateTime": "2024-06-12 16:25:38",
                                "comment_score": 1,
                                "replies": []
                            }
                        ]
                    }
                ]
            },
            {
                "comment_id": "l8xpz4a",
                "comment_body": "I guess it would be better for you to ask in the r/LegacyJailbreak subreddit for more help on a legacy device",
                "comment_author": "Puzzleheaded-Wish-32",
                "comment_dateTime": "2024-06-17 02:44:13",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Weird opaque “cursor” stuck on my screen, disabling auto lock and keeping my phone screen on the entire night.",
        "post_score": 2,
        "post_id": "1de6a9p",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de6a9p/weird_opaque_cursor_stuck_on_my_screen_disabling/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 15:10:42",
        "post_text": "So a few days ago, I connected a ps5 controller so I could play the delta emulator, all went smoothly. That is until I stopped playing, a odd little dot sat and keeps sitting on the top left of my screen and it follows if I rotate orientation. The worst effect this has had is my phone randomly turns on and STAYS on until I manually turn it off, which suffice to say is terrible for battery. I believe this problem may have begun with the ps5 controller, since it has a touchpad and maybe it triggered the pointer controls? Well the touch pad doesn't even work and my settings say it's hiding the cursor when it absolutely is not. Tried shutting down the phone and everything, nothing. Any help appreciated.",
        "post_comments": [
            {
                "comment_id": "l8cl5bl",
                "comment_body": "try disconnecting the bluetooth device from the menu on the phone or turn on airplane mode. If you can disconnect and it acts normally then you know for sure what your issue is.",
                "comment_author": "stupid_trollz",
                "comment_dateTime": "2024-06-13 01:47:10",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "Find My only show my phone in location sharing while the app is open",
        "post_score": 2,
        "post_id": "1de6075",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de6075/find_my_only_show_my_phone_in_location_sharing/",
        "post_numComments": 2,
        "post_dateTime": "2024-06-12 14:57:03",
        "post_text": "Hi\n\nIm trying to share my iphone location in the Find My app with my family, but they can't see my locaiton when the phone is locked or the app is not open.\n\nI tried to look up the settings and I have location sharing enabled everywhere. My only concern is that in the location sharing setting there is no option for the Find My app to always share location. I only have to options to Share it Once, While using the app or Never.\n\nPhone restart and hard reset(vol up, down, power hold) did not solve it.\n\nI can see the others fine, there is no issue wit that. I also chech previous post about similar issues, but did not find a solution for it.\n\n  \nAnyone has an idea what could be the issue?",
        "post_comments": [
            {
                "comment_id": "l89jxcw",
                "comment_body": "Found the issue if anyone wonders. The problem was the iphone copied my contacts from viber and they were just viber conacts with phone numbers. After I manually added them again the problem was solved.",
                "comment_author": "Environmental_Gap_30",
                "comment_dateTime": "2024-06-12 15:13:07",
                "comment_score": 1,
                "replies": []
            }
        ]
    },
    {
        "post_title": "iPhone 6s with broken home button disabled",
        "post_score": 1,
        "post_id": "1de5lcu",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de5lcu/iphone_6s_with_broken_home_button_disabled/",
        "post_numComments": 5,
        "post_dateTime": "2024-06-12 14:36:23",
        "post_text": "hi, I put the incorrect password in too many times & it says disabled connect to iTunes. Is there any way to get it to recovery mode so I can re-enable it without the home button? mine is broken lol ",
        "post_comments": [
            {
                "comment_id": "l89gd5a",
                "comment_body": "iphone 6s!?!!🫣 it's time to upgrade or take it to phone repair guy",
                "comment_author": "Dry-Piccolo-255",
                "comment_dateTime": "2024-06-12 14:48:44",
                "comment_score": 1,
                "replies": [
                    {
                        "comment_id": "l89h8hy",
                        "comment_body": "I’m trying to get my old photos haha!! it lasted me 7 years, I have an iPhone 11 now tho🤞",
                        "comment_author": "retro-skate",
                        "comment_dateTime": "2024-06-12 14:54:47",
                        "comment_score": 1,
                        "replies": []
                    }
                ]
            },
            {
                "comment_id": "l89qoz0",
                "comment_body": "If only the button was broken, it would be easy to retrieve your photos but since it is disabled, it will be harder to do but it’s theoretically possible",
                "comment_author": "AdLeading4203",
                "comment_dateTime": "2024-06-12 15:56:26",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l89vfw2",
                "comment_body": "Try assistive touch to enable accessibility, then use it to restore your iPhone.",
                "comment_author": "OptioAngustus1433",
                "comment_dateTime": "2024-06-12 16:25:05",
                "comment_score": 0,
                "replies": []
            }
        ]
    },
    {
        "post_title": "iphone 14pro static noise coming from back",
        "post_score": 11,
        "post_id": "1de5ebu",
        "post_url": "https://i.redd.it/6kmjf2kew46d1.jpeg",
        "post_numComments": 6,
        "post_dateTime": "2024-06-12 14:26:19",
        "post_text": "when i put my ear next to this part of the back of my iphone i hear sort of a static sound and when i use the power button to activate siri it gets louder. Sound is sort of like an old cd running staticy crackling",
        "post_comments": [
            {
                "comment_id": "l8axeyf",
                "comment_body": "It’s coil whine. Anything that spins up your processor (activating Siri for example) will cause it. Nothing to be concerned about.",
                "comment_author": "SushiBallZ",
                "comment_dateTime": "2024-06-12 19:59:32",
                "comment_score": 2,
                "replies": []
            },
            {
                "comment_id": "l89dlvg",
                "comment_body": "also its not background sound",
                "comment_author": "FarerSpreal",
                "comment_dateTime": "2024-06-12 14:28:45",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8c3twx",
                "comment_body": "Same phone and same thing happening, maybe it’s normal idk?",
                "comment_author": "SadBakerr58",
                "comment_dateTime": "2024-06-12 23:56:12",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8z3fv8",
                "comment_body": "*Bees*",
                "comment_author": "Ornery-Practice9772",
                "comment_dateTime": "2024-06-17 10:36:44",
                "comment_score": 1,
                "replies": []
            },
            {
                "comment_id": "l8ab7tm",
                "comment_body": "I’m not no expert but I would say watch out for any kind of smoking / heat. Does it happen when you turn it off or does it stop?",
                "comment_author": "xrrej",
                "comment_dateTime": "2024-06-12 17:56:40",
                "comment_score": 0,
                "replies": []
            }
        ]
    },
    {
        "post_title": "iPhone 14 base model glitching",
        "post_score": 0,
        "post_id": "1de58lt",
        "post_url": "https://www.reddit.com/r/iphone/comments/1de58lt/iphone_14_base_model_glitching/",
        "post_numComments": 0,
        "post_dateTime": "2024-06-12 14:17:45",
        "post_text": "My brothers iPhone 14 randomly started glitching. His cameras and Face ID stopped working. The screens refresh rate has slowed down dramatically and his AirPods won’t stay connected. We already tried factory resetting it and nothing changed ",
        "post_comments": []
    }
]